
#Область ПрограммныйИнтерфейс

// Возвращает параметры конвертации.
//
// Параметры:
//  ИмяКонвертации - Строка - Имя конвертации.
// 
// Возвращаемое значение:
//   - Структура.
//
Функция ЗаполнитьПараметрыКонвертации(ИмяКонвертации) Экспорт
	
	ПараметрыКонвертации = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонвертацииПараметры.Параметр КАК Параметр
		|ИЗ
		|	Справочник.Конвертации.Параметры КАК КонвертацииПараметры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конвертации КАК Конвертации
		|		ПО КонвертацииПараметры.Ссылка = Конвертации.Ссылка
		|ГДЕ
		|	Конвертации.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ИмяКонвертации);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыКонвертации.Вставить(ВыборкаДетальныеЗаписи.Параметр, "");
	КонецЦикла;
	
	Возврат ПараметрыКонвертации;
	
КонецФункции

#КонецОбласти
