
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(Объект.Конвертация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравилаОбработкиДанных

&НаКлиенте
Процедура Расш1_ПравилаОбработкиДанныхВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Расш1_ОбработкаВыбораПродолжение(СтандартнаяОбработка, "Справочник.ПравилаОбработкиДанных.Форма.ФормаЭлемента", ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравилаКонвертацииОбъектов

&НаКлиенте
Процедура Расш1_ПравилаКонвертацииОбъектовВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Расш1_ОбработкаВыбораПродолжение(СтандартнаяОбработка, "Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента", ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАлгоритмы

&НаКлиенте
Процедура Расш1_АлгоритмыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Расш1_ОбработкаВыбораПродолжение(СтандартнаяОбработка, "Справочник.Алгоритмы.Форма.ФормаЭлемента", ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Расш1_ОбработкаВыбораПродолжение(СтандартнаяОбработка, ИмяФормы, ВыбраннаяСтрока)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Конвертация", Объект.Конвертация);
	ПараметрыОткрытия.Вставить("Ключ", ВыбраннаяСтрока);
	ОткрытьФорму(ИмяФормы, ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
