
&Вместо("ОбновитьИндикациюСтраницОбработчиков")
Процедура Расш1_ОбновитьИндикациюСтраницОбработчиков(КоллекцияСтраниц, ОбъектФормы, ПоляИсключения)
	Для Каждого СтраницаОбработчика Из КоллекцияСтраниц.ПодчиненныеЭлементы Цикл
		Если НЕ СтраницаОбработчика.Видимость Тогда
			Продолжить;
		КонецЕсли;
		ОтображатьФлажок = Ложь;
		Для Каждого ПолеОбработчика Из СтраницаОбработчика.ПодчиненныеЭлементы Цикл
			Если НРег(Лев(ПолеОбработчика.Имя, 8)) <> "алгоритм" Тогда
				Продолжить;
			ИначеЕсли НЕ ПустаяСтрока(ПоляИсключения) И СтрНайти(ПолеОбработчика.Имя, ПоляИсключения) > 0 Тогда
				Продолжить;
			КонецЕсли;
			// Изменение 09.01.2021 Начало
			Если ОбъектФормы.Свойство(ПолеОбработчика.Имя) Тогда
				ОтображатьФлажок = ЗначениеЗаполнено(ОбъектФормы[ПолеОбработчика.Имя]);
			КонецЕсли;
			// Изменение 09.01.2021 Окончание
		КонецЦикла;
		Если ОтображатьФлажок Тогда 
			СтраницаОбработчика.Картинка = БиблиотекаКартинок.Успешно;
		Иначе
			СтраницаОбработчика.Картинка = Новый Картинка();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
