
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОписаниеМетеданных(Запрос, Конфигурация) Экспорт
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	СоответствиеКоллекцииМетаданных = Расш1_КоллекцияМетаданных.СоответствиеКоллекцииМетаданных();
	
	// Описание всех объектов конфигурации.
	КоллекцияМетаданных = Новый Структура();
	
	ЗаполнитьРеквизитыОбъектов(РезультатЗапросаПакет, СоответствиеКоллекцииМетаданных, КоллекцияМетаданных);
	ЗаполнитьПредопределенныеЗначения(РезультатЗапросаПакет, СоответствиеКоллекцииМетаданных, КоллекцияМетаданных);
	СохранитьОписаниеМетаданныхВИБ(КоллекцияМетаданных, Конфигурация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыОбъектов(РезультатЗапросаПакет, СоответствиеКоллекцииМетаданных, КоллекцияМетаданных)
	
	ВыборкаВидМетаданных = РезультатЗапросаПакет[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидМетаданных.Следующий() Цикл
		
		ОписаниеКоллекции = Новый Структура();
		
		ВидОбъекта = ВыборкаВидМетаданных.ВидОбъекта;
		
		ВыборкаРеквизитыИмяОбъект = ВыборкаВидМетаданных.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРеквизитыИмяОбъект.Следующий() Цикл
			
			ИмяОбъекта = ВыборкаРеквизитыИмяОбъект.ИмяОбъекта;
			
			ВыборкаРеквизитыТЧ = ВыборкаРеквизитыИмяОбъект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРеквизитыТЧ.Следующий() Цикл
				
				Если ВыборкаРеквизитыТЧ.ТабличнаяЧасть.Пустая() Тогда
					ИмяТЧОбъекта = "";
				Иначе
					ИмяТЧОбъекта = ВыборкаРеквизитыТЧ.ТабличнаяЧасть;
				КонецЕсли;
				
				ОписаниеРеквизитов = Новый Структура();
				
				ВыборкаРеквизиты = ВыборкаРеквизитыТЧ.Выбрать();
				Пока ВыборкаРеквизиты.Следующий() Цикл
					
					ИмяРеквизита = ВыборкаРеквизиты.Реквизит;
					
					// Пока не понятно зачем нужны синонимы, когда пойму, сделаем.
					СвойстваРеквизита = Новый Структура("name", ИмяРеквизита);
					ОписаниеРеквизитов.Вставить(ИмяРеквизита, СвойстваРеквизита);
					
				КонецЦикла;
				
			КонецЦикла;
			
			СтруктураОбъекта = Новый Структура("properties", ОписаниеРеквизитов);
			//Если 0 < ОписаниеПредопределенных.Количество() Тогда
			//	СтруктураОбъекта.Вставить("predefined", ОписаниеПредопределенных); 
			//КонецЕсли;
			ОписаниеКоллекции.Вставить(ИмяОбъекта, СтруктураОбъекта);
			
		КонецЦикла;
		
		ВидОбъектаДляКоллекции = СоответствиеКоллекцииМетаданных[ВидОбъекта];
		КоллекцияМетаданных.Вставить(ВидОбъектаДляКоллекции, ОписаниеКоллекции);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеЗначения(РезультатЗапросаПакет, СоответствиеКоллекцииМетаданных, КоллекцияМетаданных)
	
	ВыборкаВидМетаданных = РезультатЗапросаПакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидМетаданных.Следующий() Цикл
		
		ВидОбъекта = ВыборкаВидМетаданных.ВидОбъекта;
		ВидОбъектаДляКоллекции = СоответствиеКоллекцииМетаданных[ВидОбъекта];
		Если КоллекцияМетаданных.Свойство(ВидОбъектаДляКоллекции) Тогда
			ЭтоПеречисление = Ложь;
			ОписаниеКоллекции = КоллекцияМетаданных[ВидОбъектаДляКоллекции];
		Иначе
			ЭтоПеречисление = Истина;
			ОписаниеКоллекции = Новый Структура;
		КонецЕсли;
			
		ВыборкаИмяОбъекта = ВыборкаВидМетаданных.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИмяОбъекта.Следующий() Цикл
			
			ИмяОбъекта = ВыборкаИмяОбъекта.ИмяОбъекта;
			
			Если ОписаниеКоллекции.Свойство(ИмяОбъекта) Тогда
				СтруктураОбъекта = ОписаниеКоллекции[ИмяОбъекта];
			Иначе
				СтруктураОбъекта = Новый Структура;
			КонецЕсли;
			
			ОписаниеПредопределенных = Новый Структура();
			ВыборкаПредопределенноеЗначение = ВыборкаИмяОбъекта.Выбрать();
			Пока ВыборкаПредопределенноеЗначение.Следующий() Цикл
				
				Значение = ВыборкаПредопределенноеЗначение.ПредопределенныеЗначения;
				ОписаниеПредопределенных.Вставить(Значение, "");
				
			КонецЦикла;
			
			СтруктураОбъекта.Вставить("predefined", ОписаниеПредопределенных); 
			
			Если ЭтоПеречисление Тогда
				ОписаниеКоллекции.Вставить(ИмяОбъекта, СтруктураОбъекта);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоПеречисление Тогда
			КоллекцияМетаданных.Вставить(ВидОбъектаДляКоллекции, ОписаниеКоллекции);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьОписаниеМетаданныхВИБ(КоллекцияМетаданных, Конфигурация)
	
	Файл = Новый ЗаписьJSON();
	Файл.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(Файл, КоллекцияМетаданных);
	Исключение
		ВызватьИсключение("Не удалось сохранить коллекцию метаданных:" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	КоллекцияJSON = Файл.Закрыть();
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Конфигурация, КоллекцияJSON);
	
КонецПроцедуры

#КонецОбласти
