#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Конвертация данных не передана на текущую форму'");
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Параметры.Конвертация), ТекстСообщения);
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриОтправке";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриОтправкеДанных, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриКонвертацииДанныхXDTO";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередПолучениемДанных, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПередЗаписьюПолученныхДанных";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриПолученииДанных, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПослеЗагрузкиВсехДанных";
		Опции.ПоказыватьНаправление = Ложь;
		Опции.ТолькоПросмотр = Истина;
		Опции.СкрытьПанельКоманд = Истина;
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.Страница_ОбработчикиXDTO, "ОбработчикиXDTO", Неопределено, Истина);
		
	Иначе
		
		Отправка = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
		Получение = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_ЗарегистрироватьАлгоритмXML(Элементы.АлгоритмПередВыгрузкойОбъекта, "Страница_ПередВыгрузкой", Отправка);
		Расш1_ЗарегистрироватьАлгоритмXML(Элементы.АлгоритмПриВыгрузкеОбъекта, "Страница_ПриВыгрузке", Отправка);
		Расш1_ЗарегистрироватьАлгоритмXML(Элементы.АлгоритмПослеВыгрузкиОбъекта, "Страница_ПослеВыгрузки", Отправка);
		Расш1_ЗарегистрироватьАлгоритмXML(
			Элементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена, "Страница_ПослеВыгрузкиВФайл", Отправка);
		Расш1_ЗарегистрироватьАлгоритмXML(Элементы.АлгоритмПоследовательностьПолейПоиска, "Страница_ПоляПоиска", Получение);
		Расш1_ЗарегистрироватьАлгоритмXML(Элементы.АлгоритмПередЗагрузкойОбъекта, "Страница_ПередЗагрузкой", Получение);
		Расш1_ЗарегистрироватьАлгоритмXML(Элементы.АлгоритмПриЗагрузкеОбъекта, "Страница_ПриЗагрузке", Получение);
		Расш1_ЗарегистрироватьАлгоритмXML(Элементы.АлгоритмПослеЗагрузкиОбъекта, "Страница_ПослеЗагрузки", Получение);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.Страница_ОбработчикиXML, "ОбработчикиXML", Неопределено, Истина);
		
	КонецЕсли;
	
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
	ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
	
	Элементы.Страницы.УстановитьДействие(
		"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
	
	ИмяГруппыОбработчиков = ?(ЭтоКонвертацияXDTO, "ОбработчикиXDTO", "ОбработчикиXML");
	Элементы[ИмяГруппыОбработчиков].УстановитьДействие(
		"ПриСменеСтраницы", "Расш1_Подключаемый_ОбработчикиПриСменеСтраницы");
	
	ИзменитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_НазначитьКонсольТекущейСтраницы();
	Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект["Конвертация"]);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если ТекущаяСтраница.Имя = "Страница_ОбработчикиXDTO" Тогда
			Если ОбластьПрименения = 1 Тогда
				ПослеФормированияКонсолей("Страница_ПриКонвертацииДанныхXDTO");
			Иначе
				ПослеФормированияКонсолей("Страница_ПриОтправке");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница.Имя = "Страница_ОбработчикиXML" Тогда
		ПослеФормированияКонсолей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#Область ЭтоКонвертацияXDTO

&ИзменениеИКонтроль("АлгоритмПослеЗагрузкиВсехДанныхОткрытие")
&НаКлиенте
Процедура Расш1_АлгоритмПослеЗагрузкиВсехДанныхОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиВсехДанных) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаАлгоритм = СсылкаНаАлгоритмПоИмени(Объект.АлгоритмПослеЗагрузкиВсехДанных, СписокКонвертаций, СовместнаяРабота);
	Если СсылкаНаАлгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = СсылкаНаАлгоритм;
	ИмяФормыАлгоритм = "Справочник.Алгоритмы.ФормаОбъекта";
	#Вставка
	ПараметрыФормы.Вставить("Конвертация", ЭтотОбъект["Конвертация"]);
	#КонецВставки
	ОткрытьФорму(ИмяФормыАлгоритм, ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&После("Тумблер_ОбластьПримененияПриИзменении")
&НаКлиенте
Процедура Расш1_Тумблер_ОбластьПримененияПриИзмененииПосле(Элемент)
	
	ИзменитьУсловноеОформление();
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "Страница_ОбработчикиXDTO" Тогда
		ИмяСтраницы = Элементы.ОбработчикиXDTO.ТекущаяСтраница.Имя;
		Расш1_ПрименитьНаправлениеКонсоли(ИмяСтраницы);
	КонецЕсли;
	
	Расш1_ПриОткрытииПосле(Ложь);
	
КонецПроцедуры

&После("АлгоритмПослеЗагрузкиВсехДанныхПриИзменении")
&НаКлиенте
Процедура Расш1_АлгоритмПослеЗагрузкиВсехДанныхПриИзмененииПосле(Элемент)
	
	Если Элементы.ОбработчикиXDTO.ТекущаяСтраница.Имя <> "Страница_ПослеЗагрузкиВсехДанных" Тогда
		Возврат;
	КонецЕсли;
	
	ИмяХоста = Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли();
	Если Элементы.Найти(ИмяХоста) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ПустаяСтрока(ЭтотОбъект[ИмяХоста]) Тогда
		Расш1_КонсольКодаКлиент.УстановитьТекст(ЭтотОбъект, ИмяХоста, АлгоритмПослеЗагрузкиВсехДанныхТекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура Расш1_ЗарегистрироватьАлгоритмXML(ЭлементАлгоритма, ИмяСтраницы, Направление)
	
	Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
	Опции.ИмяСтраницы = ИмяСтраницы;
	Опции.ПоказыватьНаправление = Ложь;
	Опции.АвтоНаправление = Направление;
	Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, ЭлементАлгоритма, Опции);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьУсловноеОформление()
	
	Если ЭтоКонвертацияXDTO Тогда
		
		ГруппаНаправления = Элементы.Найти(Расш1_КонсольКодаКлиентСервер.ИмяГруппыНаправленияХоста());
		Если ГруппаНаправления <> Неопределено Тогда
			ГруппаНаправления.Видимость = Истина;
			ГруппаНаправления.Доступность =
				Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения;
		КонецЕсли;
		
		Элементы.ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Элементы[Команда.Имя].Заголовок);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница.Имя <> "Страница_ОбработчикиXDTO" Тогда
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяСтраницы) Тогда
			ИмяСтраницы = Элементы.ОбработчикиXDTO.ТекущаяСтраница.Имя;
		КонецЕсли;
		
	Иначе
		
		Если Элементы.Страницы.ТекущаяСтраница.Имя <> "Страница_ОбработчикиXML" Тогда
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяСтраницы) Тогда
			ИмяСтраницы = Элементы.ОбработчикиXML.ТекущаяСтраница.Имя;
		КонецЕсли;
		
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	Если ЭтоКонвертацияXDTO Тогда
		Расш1_ПрименитьНаправлениеКонсоли(ИмяСтраницы);
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектовJSON =
		ПолучитьОписаниеПараметровJSON(
			ЭтотОбъект["Конвертация"],
			Объект.ОбъектКонфигурации,
			ЭтотОбъект["Направление"],
			ИмяСтраницы,
			ЭтоКонвертацияXDTO,
			Объект.ОбъектКонфигурацииКорреспондент);
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПрименитьНаправлениеКонсоли(ИмяСтраницы)
	
	Если ИмяСтраницы = "Страница_ПослеЗагрузкиВсехДанных" Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаНаправления = Элементы.Найти(Расш1_КонсольКодаКлиентСервер.ИмяГруппыНаправленияХоста());
	Если ГруппаНаправления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаНаправления.Видимость = Истина;
	
	ОбаНаправления = Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения;
	ГруппаНаправления.Доступность = ОбаНаправления;
	
	Если Объект.ИспользоватьДляОтправки И Не Объект.ИспользоватьДляПолучения Тогда
		Расш1_КонсольКодаКлиент.УстановитьНаправление(
			ЭтотОбъект, Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка());
	ИначеЕсли Объект.ИспользоватьДляПолучения И Не Объект.ИспользоватьДляОтправки Тогда
		Расш1_КонсольКодаКлиент.УстановитьНаправление(
			ЭтотОбъект, Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение());
	ИначеЕсли ОбаНаправления И Не ПустаяСтрока(ЭтотОбъект["Направление"]) Тогда
		Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, ЭтотОбъект["Направление"]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольТекущейСтраницы()
	
	Если ЭтоКонвертацияXDTO Тогда
		Если Элементы.Страницы.ТекущаяСтраница.Имя = "Страница_ОбработчикиXDTO" Тогда
			ПослеФормированияКонсолей();
		КонецЕсли;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "Страница_ОбработчикиXML" Тогда
		ПослеФормированияКонсолей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(
		Знач Конвертация,
		Знач ОбъектКонфигурации,
		Знач Направление,
		Знач ИмяСтраницы,
		Знач ЭтоКонвертацияXDTO,
		Знач ОбъектКонфигурацииКорреспондент = "")
	
	Если Не ЭтоКонвертацияXDTO Тогда
		ОписаниеОбъекта = ОбъектКонфигурации;
		Если Направление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение() Тогда
			ОписаниеОбъекта = ОбъектКонфигурацииКорреспондент;
		КонецЕсли;
		Возврат Расш1_КоллекцияМетаданных.ОписаниеПараметровСтраницыJSON(
			Расш1_ИменаПараметровПКО(ИмяСтраницы),
			Конвертация,
			ОписаниеОбъекта,
			Расш1_ИменаОбъектаПКО(ИмяСтраницы));
	КонецЕсли;
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если Не ПустаяСтрока(Направление) Тогда
			КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
			ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОбъектКонфигурации) Тогда
			ДанныеИБ = Расш1_КоллекцияМетаданных.ПолучитьОписаниеДанныеИБ(ОбъектКонфигурации);
			ПользовательскиеОбъекты.Вставить("ДанныеИБ", ДанныеИБ);
		КонецЕсли;
		
		Если ИмяСтраницы = "Страница_ПриОтправке" Тогда
			
			ПараметрыКонвертации = Расш1_КоллекцияМетаданных.ПолучитьОписаниеПараметрыКонвертации(Конвертация);
			ПользовательскиеОбъекты.Вставить("ПараметрыКонвертации", ПараметрыКонвертации);
			ПользовательскиеОбъекты.Вставить("ДанныеXDTO", "");
			ПользовательскиеОбъекты.Вставить("СтекВыгрузки", "");
			
		ИначеЕсли ИмяСтраницы = "Страница_ПриКонвертацииДанныхXDTO" Тогда
			
			ПользовательскиеОбъекты.Вставить("ДанныеXDTO", "");
			ПользовательскиеОбъекты.Вставить("ПолученныеДанные", "");
			
		ИначеЕсли ИмяСтраницы = "Страница_ПередЗаписьюПолученныхДанных" Тогда
			
			ПользовательскиеОбъекты.Вставить("КонвертацияСвойств", "");
			ПользовательскиеОбъекты.Вставить("ПолученныеДанные", "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

&НаСервереБезКонтекста
Функция Расш1_ИменаПараметровПКО(ИмяСтраницы)
	
	Страницы = Новый Соответствие;
	Страницы.Вставить("Страница_ПередВыгрузкой",
		"Параметры,Источник,Приемник,ВходящиеДанные,ИсходящиеДанные,ИмяПКО,ПКО,"
		+ "ВыгруженныеОбъекты,Отказ,КлючВыгружаемыхДанных,ЗапоминатьВыгруженные,"
		+ "НеЗапоминатьВыгруженные,НеЗамещатьОбъектПриЗагрузке,НеСоздаватьЕслиНеНайден,"
		+ "ВсеОбъектыВыгружены,ТолькоПолучитьУзелСсылки,РегистрироватьОбъектНаУзлеОтправителе,"
		+ "РежимЗаписи,РежимПроведения");
	Страницы.Вставить("Страница_ПриВыгрузке",
		"Источник,ВходящиеДанные,ИсходящиеДанные,ИмяПКО,ПКО,ВыгруженныеОбъекты,"
		+ "КлючВыгружаемыхДанных,Отказ,СтандартнаяОбработка,Приемник,УзелСсылки");
	Страницы.Вставить("Страница_ПослеВыгрузки",
		"Источник,ВходящиеДанные,ИсходящиеДанные,ИмяПКО,ПКО,ВыгруженныеОбъекты,"
		+ "КлючВыгружаемыхДанных,Отказ,Приемник,УзелСсылки");
	Страницы.Вставить("Страница_ПослеВыгрузкиВФайл",
		"Источник,ВходящиеДанные,ИсходящиеДанные,ИмяПКО,ПКО,ВыгруженныеОбъекты,Приемник,УзелСсылки");
	Страницы.Вставить("Страница_ПоляПоиска",
		"НомерВариантаПоиска,СвойстваПоиска,ПараметрыОбъекта,ПрекратитьПоиск,СсылкаНаОбъект,"
		+ "УстанавливатьУОбъектаВсеСвойстваПоиска,НастройкаПоиска,СтрокаИменСвойствПоиска");
	Страницы.Вставить("Страница_ПередЗагрузкой",
		"Отказ,Нпп,Источник,ИмяПравила,Правило,ГенерироватьНовыйНомерИлиКодЕслиНеУказан,"
		+ "ТипОбъектаСтрокой,ТипОбъекта,НеЗамещатьОбъект,РежимЗаписи,РежимПроведения");
	Страницы.Вставить("Страница_ПриЗагрузке", "ОбъектНайден,Объект,НеЗамещатьОбъект,ОбъектМодифицирован");
	Страницы.Вставить("Страница_ПослеЗагрузки",
		"Отказ,Объект,Ссылка,ОбъектНайден,ПараметрыОбъекта,ОбъектМодифицирован,ИмяТипаОбъекта,НаборЗаписей");
	
	Имена = Страницы.Получить(ИмяСтраницы);
	Если Имена = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Имена;
	
КонецФункции

&НаСервереБезКонтекста
Функция Расш1_ИменаОбъектаПКО(ИмяСтраницы)
	
	Если ИмяСтраницы = "Страница_ПередВыгрузкой"
		Или ИмяСтраницы = "Страница_ПриВыгрузке"
		Или ИмяСтраницы = "Страница_ПослеВыгрузки"
		Или ИмяСтраницы = "Страница_ПослеВыгрузкиВФайл" Тогда
		Возврат "Источник";
	КонецЕсли;
	
	Если ИмяСтраницы = "Страница_ПриЗагрузке" Тогда
		Возврат "Объект";
	КонецЕсли;
	
	Если ИмяСтраницы = "Страница_ПослеЗагрузки" Тогда
		Возврат "Объект,Ссылка";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
