#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриОтправке";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриОтправкеДанных, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриКонвертацииДанныхXDTO";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередПолучениемДанных, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПередЗаписьюПолученныхДанных";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриПолученииДанных, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПослеЗагрузкиВсехДанных";
		Опции.ПоказыватьНаправление = Ложь;
		Опции.ТолькоПросмотр = Истина;
		Опции.СкрытьПанельКоманд = Истина;
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.Страница_ОбработчикиXDTO, "ОбработчикиXDTO", Неопределено, Истина);
		
	Иначе
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПередВыгрузкой";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередВыгрузкойОбъекта, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриВыгрузке";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриВыгрузкеОбъекта, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПослеВыгрузки";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеВыгрузкиОбъекта, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПослеВыгрузкиВФайл";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПоляПоиска";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПоследовательностьПолейПоиска, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПередЗагрузкой";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередЗагрузкойОбъекта, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриЗагрузке";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриЗагрузкеОбъекта, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПослеЗагрузки";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеЗагрузкиОбъекта, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(ЭтотОбъект, Элементы.Страница_ОбработчикиXML, "ОбработчикиXML");
		
	КонецЕсли;
	
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
	ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
	
	Элементы.Страницы.УстановитьДействие(
		"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
	
	ИмяГруппыОбработчиков = ?(ЭтоКонвертацияXDTO, "ОбработчикиXDTO", "ОбработчикиXML");
	Элементы[ИмяГруппыОбработчиков].УстановитьДействие(
		"ПриСменеСтраницы", "Расш1_Подключаемый_ОбработчикиПриСменеСтраницы");
	
	ИзменитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Расш1_НазначитьКонсольТекущейСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если ТекущаяСтраница.Имя = "Страница_ОбработчикиXDTO" Тогда
			Если ОбластьПрименения = 1 Тогда
				ПослеФормированияКонсолей("Страница_ПриКонвертацииДанныхXDTO");
			Иначе
				ПослеФормированияКонсолей("Страница_ПриОтправке");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница.Имя = "Страница_ОбработчикиXML" Тогда
		ПослеФормированияКонсолей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#Область ЭтоКонвертацияXDTO

&ИзменениеИКонтроль("АлгоритмПослеЗагрузкиВсехДанныхОткрытие")
&НаКлиенте
Процедура Расш1_АлгоритмПослеЗагрузкиВсехДанныхОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиВсехДанных) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаАлгоритм = СсылкаНаАлгоритмПоИмени(Объект.АлгоритмПослеЗагрузкиВсехДанных, СписокКонвертаций, СовместнаяРабота);
	Если СсылкаНаАлгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = СсылкаНаАлгоритм;
	ИмяФормыАлгоритм = "Справочник.Алгоритмы.ФормаОбъекта";
	#Вставка
	ПараметрыФормы.Вставить("Конвертация", ЭтотОбъект["Конвертация"]);
	#КонецВставки
	ОткрытьФорму(ИмяФормыАлгоритм, ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&После("Тумблер_ОбластьПримененияПриИзменении")
&НаКлиенте
Процедура Расш1_Тумблер_ОбластьПримененияПриИзмененииПосле(Элемент)
	
	ГруппаНаправления = Элементы.Найти(Расш1_КонсольКодаКлиентСервер.ИмяГруппыНаправленияХоста());
	Если ГруппаНаправления <> Неопределено Тогда
		ГруппаНаправления.Заголовок = "Направление";
	КонецЕсли;
	
	ИзменитьУсловноеОформление();
	Расш1_ПриОткрытииПосле(Ложь);
	
КонецПроцедуры

&После("АлгоритмПослеЗагрузкиВсехДанныхПриИзменении")
&НаКлиенте
Процедура Расш1_АлгоритмПослеЗагрузкиВсехДанныхПриИзмененииПосле(Элемент)
	
	Если Элементы.ОбработчикиXDTO.ТекущаяСтраница.Имя <> "Страница_ПослеЗагрузкиВсехДанных" Тогда
		Возврат;
	КонецЕсли;
	
	ИмяХоста = Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли();
	Если Не ПустаяСтрока(ЭтотОбъект[ИмяХоста]) Тогда
		Расш1_КонсольКодаКлиент.УстановитьТекст(ЭтотОбъект, ИмяХоста, АлгоритмПослеЗагрузкиВсехДанныхТекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьУсловноеОформление()
	
	Если ЭтоКонвертацияXDTO Тогда
		
		ГруппаНаправления = Элементы.Найти(Расш1_КонсольКодаКлиентСервер.ИмяГруппыНаправленияХоста());
		Если ГруппаНаправления <> Неопределено Тогда
			ГруппаНаправления.Видимость = Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения;
		КонецЕсли;
		
		Элементы.ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	ПослеФормированияКонсолей();
	
	Элементы[Команда.Имя].Родитель.Заголовок = Элементы[Команда.Имя].Заголовок;
	Элементы[Команда.Имя].Родитель.Картинка = Элементы[Команда.Имя].Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница.Имя <> "Страница_ОбработчикиXDTO" Тогда
			Возврат;
		КонецЕсли;
		
		Если ОбластьПрименения = 2 Тогда
			Направление = "";
		ИначеЕсли ОбластьПрименения = 0 Тогда
			Направление = "Отправка";
		Иначе
			Направление = "Получение";
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяСтраницы) Тогда
			ИмяСтраницы = Элементы.ОбработчикиXDTO.ТекущаяСтраница.Имя;
		КонецЕсли;
		
	Иначе
		
		Если Элементы.Страницы.ТекущаяСтраница.Имя <> "Страница_ОбработчикиXML" Тогда
			Возврат;
		КонецЕсли;
		
		Направление = "";
		Если ПустаяСтрока(ИмяСтраницы) Тогда
			ИмяСтраницы = Элементы.ОбработчикиXML.ТекущаяСтраница.Имя;
		КонецЕсли;
		
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	Расш1_ОбновитьВидимостьНаправления(ИмяСтраницы);
	
	ОписаниеПользовательскихОбъектовJSON =
		ПолучитьОписаниеПараметровJSON(
			ЭтотОбъект["Конвертация"], Объект.ОбъектКонфигурации, Направление, ИмяСтраницы, ЭтоКонвертацияXDTO);
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбновитьВидимостьНаправления(ИмяСтраницы)
	
	Если Не ЭтоКонвертацияXDTO Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаНаправления = Элементы.Найти(Расш1_КонсольКодаКлиентСервер.ИмяГруппыНаправленияХоста());
	Если ГруппаНаправления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницы = "Страница_ПослеЗагрузкиВсехДанных" Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаНаправления.Видимость = Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольТекущейСтраницы()
	
	Если ЭтоКонвертацияXDTO Тогда
		Если Элементы.Страницы.ТекущаяСтраница.Имя = "Страница_ОбработчикиXDTO" Тогда
			ПослеФормированияКонсолей();
		КонецЕсли;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "Страница_ОбработчикиXML" Тогда
		ПослеФормированияКонсолей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(
		Знач Конвертация, Знач ОбъектКонфигурации, Знач Направление, Знач ИмяСтраницы, Знач ЭтоКонвертацияXDTO)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если Не ПустаяСтрока(Направление) Тогда
			КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
			ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОбъектКонфигурации) Тогда
			ДанныеИБ = Расш1_КоллекцияМетаданных.ПолучитьОписаниеДанныеИБ(ОбъектКонфигурации);
			ПользовательскиеОбъекты.Вставить("ДанныеИБ", ДанныеИБ);
		КонецЕсли;
		
		Если ИмяСтраницы = "Страница_ПриОтправке" Тогда
			
			ПараметрыКонвертации = Расш1_КоллекцияМетаданных.ПолучитьОписаниеПараметрыКонвертации(Конвертация);
			ПользовательскиеОбъекты.Вставить("ПараметрыКонвертации", ПараметрыКонвертации);
			ПользовательскиеОбъекты.Вставить("ДанныеXDTO", "");
			ПользовательскиеОбъекты.Вставить("СтекВыгрузки", "");
			
		ИначеЕсли ИмяСтраницы = "Страница_ПриКонвертацииДанныхXDTO" Тогда
			
			ПользовательскиеОбъекты.Вставить("ДанныеXDTO", "");
			ПользовательскиеОбъекты.Вставить("ПолученныеДанные", "");
			
		ИначеЕсли ИмяСтраницы = "Страница_ПередЗаписьюПолученныхДанных" Тогда
			
			ПользовательскиеОбъекты.Вставить("КонвертацияСвойств", "");
			ПользовательскиеОбъекты.Вставить("ПолученныеДанные", "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

#КонецОбласти
