#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПриОтправкеДанных, Элементы.Страница_ПриОтправке, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередПолучениемДанных, Элементы.Страница_ПриКонвертацииДанныхXDTO, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПриПолученииДанных, Элементы.Страница_ПередЗаписьюПолученныхДанных, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст, Элементы.Страница_ПослеЗагрузкиВсехДанных, ЭтотОбъект);
		
	Иначе
		
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередВыгрузкойОбъекта, Элементы.Страница_ПередВыгрузкой, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПриВыгрузкеОбъекта, Элементы.Страница_ПриВыгрузке, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеВыгрузкиОбъекта, Элементы.Страница_ПослеВыгрузки, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена, Элементы.Страница_ПослеВыгрузкиВФайл, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПоследовательностьПолейПоиска, Элементы.Страница_ПоляПоиска, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередЗагрузкойОбъекта, Элементы.Страница_ПередЗагрузкой, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПриЗагрузкеОбъекта, Элементы.Страница_ПриЗагрузке, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеЗагрузкиОбъекта, Элементы.Страница_ПослеЗагрузки, ЭтотОбъект);
		
	КонецЕсли;
	
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
	ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
	
	ИзменитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Расш1_НазначитьКонсольТекущейСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "Страница_ОбработчикиXDTO" Тогда
		
		Если ОбластьПрименения = 1 Тогда
			ПослеФормированияКонсолей("Страница_ПриКонвертацииДанныхXDTO");
		Иначе
			ПослеФормированияКонсолей("Страница_ПриОтправке");
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница.Имя = "Страница_ОбработчикиXML" Тогда
		ПослеФормированияКонсолей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработчикиXMLПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	
	Если Элемент.Имя = Расш1_КонсольКодаКлиентСервер.ИмяЭлементаHTML(Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст.Имя) Тогда
		Расш1_КонсольКодаКлиент.УстановитьТолькоПросмотр(ЭтотОбъект, Элемент.Имя, Истина);
	КонецЕсли;
	
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#Область ЭтоКонвертацияXDTO

&НаКлиенте
Процедура Расш1_АлгоритмПослеЗагрузкиВсехДанныхОткрытиеВместо(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиВсехДанных) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаАлгоритм = СсылкаНаАлгоритмПоИмени(Объект.АлгоритмПослеЗагрузкиВсехДанных, СписокКонвертаций, СовместнаяРабота);
	Если СсылкаНаАлгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = СсылкаНаАлгоритм;
	ИмяФормыАлгоритм = "Справочник.Алгоритмы.ФормаОбъекта";
	ПараметрыФормы.Вставить("Конвертация", ЭтотОбъект["Конвертация"]);
	ОткрытьФорму(ИмяФормыАлгоритм, ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Тумблер_ОбластьПримененияПриИзмененииПосле(Элемент)
	
	Элементы.НаправлениеАлгоритмПриОтправкеДанныхHTML.Заголовок = "Направление";
	Элементы.НаправлениеАлгоритмПередПолучениемДанныхHTML.Заголовок = "Направление";
	Элементы.НаправлениеАлгоритмПриПолученииДанныхHTML.Заголовок = "Направление";
	
	ИзменитьУсловноеОформление();
	Расш1_ПриОткрытииПосле(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_АлгоритмПослеЗагрузкиВсехДанныхПриИзмененииПосле(Элемент)
	
	ИмяЭлементаHTML = Расш1_КонсольКодаКлиентСервер.ИмяЭлементаHTML(Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст.Имя);
	Если Не ПустаяСтрока(ЭтотОбъект[ИмяЭлементаHTML]) Тогда
		Расш1_КонсольКодаКлиент.УстановитьТекст(ЭтотОбъект, ИмяЭлементаHTML, АлгоритмПослеЗагрузкиВсехДанныхТекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьУсловноеОформление()
	
	Если ЭтоКонвертацияXDTO Тогда
		
		ВидимостьНаправления = Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения;
		Элементы.НаправлениеАлгоритмПриОтправкеДанныхHTML.Видимость = ВидимостьНаправления;
		Элементы.НаправлениеАлгоритмПередПолучениемДанныхHTML.Видимость = ВидимостьНаправления;
		Элементы.НаправлениеАлгоритмПриПолученииДанныхHTML.Видимость = ВидимостьНаправления;
		
		Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекстHTMLПанельКоманд.Видимость = Ложь;
		Элементы.ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	ПослеФормированияКонсолей();
	
	Элементы[Команда.Имя].Родитель.Заголовок = Элементы[Команда.Имя].Заголовок;
	Элементы[Команда.Имя].Родитель.Картинка = Элементы[Команда.Имя].Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница.Имя <> "Страница_ОбработчикиXDTO" Тогда
			Возврат;
		КонецЕсли;
		
		Если ОбластьПрименения = 2 Тогда
			Направление = "";
		ИначеЕсли ОбластьПрименения = 0 Тогда
			Направление = "Отправка";
		Иначе
			Направление = "Получение";
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяСтраницы) Тогда
			ИмяСтраницы = Элементы.ОбработчикиXDTO.ТекущаяСтраница.Имя;
		КонецЕсли;
		
	Иначе
		
		Если Элементы.Страницы.ТекущаяСтраница.Имя <> "Страница_ОбработчикиXML" Тогда
			Возврат;
		КонецЕсли;
		
		Направление = "";
		Если ПустаяСтрока(ИмяСтраницы) Тогда
			ИмяСтраницы = Элементы.ОбработчикиXML.ТекущаяСтраница.Имя;
		КонецЕсли;
		
	КонецЕсли;
	
	Расш1_НазначитьКонсольСтраницы(ИмяСтраницы);
	
	ОписаниеПользовательскихОбъектовJSON =
		ПолучитьОписаниеПараметровJSON(
			ЭтотОбъект["Конвертация"], Объект.ОбъектКонфигурации, Направление, ИмяСтраницы, ЭтоКонвертацияXDTO);
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(ЭтотОбъект, Расш1_ИмяЭлементаHTMLСтраницы(ИмяСтраницы), ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольТекущейСтраницы()
	
	Если ЭтоКонвертацияXDTO Тогда
		Если Элементы.Страницы.ТекущаяСтраница.Имя = "Страница_ОбработчикиXDTO" Тогда
			ПослеФормированияКонсолей();
		КонецЕсли;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "Страница_ОбработчикиXML" Тогда
		ПослеФормированияКонсолей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольСтраницы(ИмяСтраницы)
	
	ИмяЭлементаАлгоритма = Расш1_ИмяЭлементаАлгоритмаСтраницы(ИмяСтраницы);
	Если Не ПустаяСтрока(ИмяЭлементаАлгоритма) Тогда
		Расш1_КонсольКодаКлиент.НазначитьРеквизитуКонсолиАдрес(ЭтотОбъект, ИмяЭлементаАлгоритма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Расш1_ИмяЭлементаАлгоритмаСтраницы(ИмяСтраницы)
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если ИмяСтраницы = "Страница_ПриОтправке" Тогда
			Возврат Элементы.АлгоритмПриОтправкеДанных.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПриКонвертацииДанныхXDTO" Тогда
			Возврат Элементы.АлгоритмПередПолучениемДанных.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПередЗаписьюПолученныхДанных" Тогда
			Возврат Элементы.АлгоритмПриПолученииДанных.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПослеЗагрузкиВсехДанных" Тогда
			Возврат Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст.Имя;
		КонецЕсли;
		
	Иначе
		
		Если ИмяСтраницы = "Страница_ПередВыгрузкой" Тогда
			Возврат Элементы.АлгоритмПередВыгрузкойОбъекта.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПриВыгрузке" Тогда
			Возврат Элементы.АлгоритмПриВыгрузкеОбъекта.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПослеВыгрузки" Тогда
			Возврат Элементы.АлгоритмПослеВыгрузкиОбъекта.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПослеВыгрузкиВФайл" Тогда
			Возврат Элементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПоляПоиска" Тогда
			Возврат Элементы.АлгоритмПоследовательностьПолейПоиска.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПередЗагрузкой" Тогда
			Возврат Элементы.АлгоритмПередЗагрузкойОбъекта.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПриЗагрузке" Тогда
			Возврат Элементы.АлгоритмПриЗагрузкеОбъекта.Имя;
		ИначеЕсли ИмяСтраницы = "Страница_ПослеЗагрузки" Тогда
			Возврат Элементы.АлгоритмПослеЗагрузкиОбъекта.Имя;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция Расш1_ИмяЭлементаHTMLСтраницы(ИмяСтраницы)
	
	ИмяЭлементаАлгоритма = Расш1_ИмяЭлементаАлгоритмаСтраницы(ИмяСтраницы);
	Если ПустаяСтрока(ИмяЭлементаАлгоритма) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Расш1_КонсольКодаКлиентСервер.ИмяЭлементаHTML(ИмяЭлементаАлгоритма);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(
		Знач Конвертация, Знач ОбъектКонфигурации, Знач Направление, Знач ИмяСтраницы, Знач ЭтоКонвертацияXDTO)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Если Не ПустаяСтрока(Направление) Тогда
			КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
			ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОбъектКонфигурации) Тогда
			ДанныеИБ = Расш1_КоллекцияМетаданных.ПолучитьОписаниеДанныеИБ(ОбъектКонфигурации);
			ПользовательскиеОбъекты.Вставить("ДанныеИБ", ДанныеИБ);
		КонецЕсли;
		
		Если ИмяСтраницы = "Страница_ПриОтправке" Тогда
			
			ПараметрыКонвертации = Расш1_КоллекцияМетаданных.ПолучитьОписаниеПараметрыКонвертации(Конвертация);
			ПользовательскиеОбъекты.Вставить("ПараметрыКонвертации", ПараметрыКонвертации);
			ПользовательскиеОбъекты.Вставить("ДанныеXDTO", "");
			ПользовательскиеОбъекты.Вставить("СтекВыгрузки", "");
			
		ИначеЕсли ИмяСтраницы = "Страница_ПриКонвертацииДанныхXDTO" Тогда
			
			ПользовательскиеОбъекты.Вставить("ДанныеXDTO", "");
			ПользовательскиеОбъекты.Вставить("ПолученныеДанные", "");
			
		ИначеЕсли ИмяСтраницы = "Страница_ПередЗаписьюПолученныхДанных" Тогда
			
			ПользовательскиеОбъекты.Вставить("КонвертацияСвойств", "");
			ПользовательскиеОбъекты.Вставить("ПолученныеДанные", "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

#КонецОбласти
