#Область ПрограммныйИнтерфейс

Функция СоответствиеКоллекцииМетаданных() Экспорт
	
	КоллекцияМетаданных = Новый Соответствие;
	КоллекцияМетаданных.Вставить("Справочники", "catalogs");
	КоллекцияМетаданных.Вставить("Документы", "documents");
	КоллекцияМетаданных.Вставить("РегистрыСведений", "infoRegs");
	КоллекцияМетаданных.Вставить("РегистрыНакопления", "accumRegs");
	КоллекцияМетаданных.Вставить("РегистрыБухгалтерии", "accountRegs");
	КоллекцияМетаданных.Вставить("Обработки", "dataProc");
	КоллекцияМетаданных.Вставить("Отчеты", "reports");
	КоллекцияМетаданных.Вставить("Перечисления", "enums");
	//КоллекцияМетаданных.Вставить("commonModules", ОписатьОбщиеМодули(Метаданные.ОбщиеМодули));
	КоллекцияМетаданных.Вставить("ПланыСчетов", "сhartsOfAccounts");
	КоллекцияМетаданных.Вставить("БизнесПроцессы", "businessProcesses");
	КоллекцияМетаданных.Вставить("Задачи", "tasks");
	КоллекцияМетаданных.Вставить("ПланыОбмена", "exchangePlans");
	КоллекцияМетаданных.Вставить("ПланыВидовХарактеристик", "chartsOfCharacteristicTypes");
	КоллекцияМетаданных.Вставить("ПланыВидовРасчета", "chartsOfCalculationTypes");
	
	Возврат КоллекцияМетаданных;
	
КонецФункции

#КонецОбласти
