#Область ПрограммныйИнтерфейс

// Получить макет внешнего объекта по работе с консолью кода в поле HTML.
// 
// Возвращаемое значение:
//   - Строка - адрес макета во временном хранилище.
//
Функция ПолучитьМакетКонсоли() Экспорт
	
	Макет = ПолучитьОбщийМакет("bsl_console");
	АдресМакета = ПоместитьВоВременноеХранилище(Макет, Новый УникальныйИдентификатор);
	
	Возврат АдресМакета;
	
КонецФункции

#КонецОбласти



//ИСПОЛЬЗОВАНИЕ VAEditor.
//&НаСервере
//Procedure VanessaEditorLoad()
//	
//	Макет = ПолучитьОбщийМакет("VanessaEditor");
//	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
//	УдалитьФайлы(ИмяВременногоФайла);
//	СоздатьКаталог(ИмяВременногоФайла);
//	
//	ЧтениеZipФайла = Новый ЧтениеZipФайла(Макет.OpenStreamForRead());
//	Для Каждого ФайлАрхива In ЧтениеZipФайла.Элементы Цикл
//		ЧтениеZipФайла.Извлечь(ФайлАрхива, ИмяВременногоФайла, РежимВосстановленияПутейФайловZIP.Восстанавливать);
//		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла + ПолучитьРазделительПути() + ФайлАрхива.ПолноеИмя);
//		ПередКонвертациейHTML = GetInfoBaseURL() + "/" + ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор)
//			+ "&localeCode=" + Лев(ТекущийЯзыкСистемы(), 2);
//	КонецЦикла;
//	УдалитьФайлы(ИмяВременногоФайла);

//EndProcedure


