
#Область ПрограммныйИнтерфейс

// Возвращает запрос по загруженным объектам метеданных требуемой конфигурации.
//
// Параметры:
//  Релиз - СправочникСсылка - Релизы.
// 
// Возвращаемое значение:
//   - Запрос.
//
Функция ПолучитьОписаниеМетеданныхКонфигурации(Релиз) Экспорт
	
	Макет = ПолучитьМакет("Расш1_Запрос_ОписаниеМетаданныхОбъектов");
	ТекстЗапроса = Макет.ПолучитьТекст();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Релиз);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

