
#Область ПрограммныйИнтерфейс

// Возвращает запрос по загруженным объектам метеданных требуемой конфигурации.
//
// Параметры:
//  Конфигурация - СправочникСсылка - Конфигурации.
// 
// Возвращаемое значение:
//   - Запрос.
//
Функция ПолучитьОписаниеМетеданныхКонфигурации(Конфигурация) Экспорт
	
	Макет = ПолучитьМакет("Расш1_Запрос_ОписаниеМетаданныхОбъектов");
	ТекстЗапроса = Макет.ПолучитьТекст();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Конфигурация);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

