
#Область ПрограммныйИнтерфейс

// Список имен и синонимов объектов коллекции метаданных релиза.
//
// Параметры:
//  Релиз - СправочникСсылка.Релизы
//  ИмяКоллекции - Строка
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьОписаниеКоллекцииМетаданных(Релиз, ИмяКоллекции) Экспорт
	
	Макет = ПолучитьМакет("Расш1_Запрос_ОписаниеКоллекцииМетаданных");
	ТекстЗапроса = Макет.ПолучитьТекст(); 
	
	ИменаКоллекцииМетаданных = Расш1_МодульПовтИсп.НовыеИменаКоллекцииМетаданных();
	Имя = ИменаКоллекцииМетаданных[ИмяКоллекции];
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("Владелец", Релиз);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКоллекцииМетаданных = Новый Структура;
	Пока Выборка.Следующий() Цикл
		
		ОписаниеЭлемента = Новый Структура;
		ОписаниеЭлемента.Вставить("name", Выборка.Синоним);
		ОписаниеКоллекцииМетаданных.Вставить(Выборка.Имя, ОписаниеЭлемента);
		
	КонецЦикла;
	
	Возврат ОписаниеКоллекцииМетаданных;
	
КонецФункции

#КонецОбласти
