// @strict-types

#Область ПрограммныйИнтерфейс

// Расширение глобального контекста по добавлению записи в журнал регистрации.
//
// Параметры:
//  ИмяСобытия	 - Строка
//  Уровень		 - Строка - имя уровня: Ошибка, Предупреждение, Информация, Примечание.
//  Комментарий	 - Строка
//
Процедура ДобавитьЗапись(ИмяСобытия, Уровень, Комментарий = "") Экспорт
	
	УровеньЗаписи = УровеньЖурналаПоИмени(Уровень);
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЗаписи, , , Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УровеньЖурналаПоИмени(Уровень)
	
	Уровни = Новый Соответствие;
	Уровни.Вставить("Ошибка", УровеньЖурналаРегистрации.Ошибка);
	Уровни.Вставить("Предупреждение", УровеньЖурналаРегистрации.Предупреждение);
	Уровни.Вставить("Информация", УровеньЖурналаРегистрации.Информация);
	Уровни.Вставить("Примечание", УровеньЖурналаРегистрации.Примечание);
	
	УровеньЗаписи = Уровни.Получить(Уровень);
	Если УровеньЗаписи = Неопределено Тогда
		ШаблонТекста = НСтр("ru = 'Неизвестный уровень журнала регистрации: %1'");
		ТекстОшибки = СтрШаблон(ШаблонТекста, Уровень);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат УровеньЗаписи;
	
КонецФункции

#КонецОбласти
