#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЭтоКонвертацияXDTO Тогда
		
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.Алгоритм, ЭтотОбъект, ЭтотОбъект);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если ЭтоКонвертацияXDTO Тогда
		Расш1_КонсольКодаКлиент.НазначитьРеквизитуКонсолиАдрес(ЭтотОбъект, Элементы.Алгоритм.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если ЭтоКонвертацияXDTO Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	Направление = Элементы[Команда.Имя].Заголовок;
	
	ПослеФормированияКонсолей();
	
	Элементы[Команда.Имя].Родитель.Заголовок = Направление;
	Элементы[Команда.Имя].Родитель.Картинка = Элементы[Команда.Имя].Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей()
	
	ОписаниеПользовательскихОбъектовJSON = ПолучитьОписаниеПараметровJSON(ЭтотОбъект["Направление"], Объект.Параметры);
	Если ПустаяСтрока(ОписаниеПользовательскихОбъектовJSON) Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаHTML(Элементы.Алгоритм.Имя),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(Знач Направление, Параметры)
	
	ОписаниеПользовательскихОбъектовJSON = "";
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если Не ПустаяСтрока(Направление) Тогда
		КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
		ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	КонецЕсли;
	
	ПараметрыАлгоритма = Параметры;
	Если Не ПустаяСтрока(ПараметрыАлгоритма) Тогда
		СписокПараметров = СтрРазделить(ПараметрыАлгоритма, ",", Ложь);
		Для Каждого Параметр Из СписокПараметров Цикл
			ПозицияЗнакаРавно = СтрНайти(Параметр, "=");
			Если ПозицияЗнакаРавно = 0 Тогда
				ПользовательскиеОбъекты.Вставить(СокрЛП(Параметр), "");
			Иначе
				ПользовательскиеОбъекты.Вставить(СокрЛП(Лев(Параметр, ПозицияЗнакаРавно - 1)), "");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

#КонецОбласти
