#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения = НСтр("ru = 'Конвертация данных не передана на текущую форму'");
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Параметры.Конвертация), ТекстСообщения);
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
	Опции.ИмяСтраницы = "Алгоритм";
	Если Не ЭтоКонвертацияXDTO Тогда
		Опции.ПоказыватьНаправление = Ложь;
		Если Объект.ИспользуетсяПриЗагрузке Тогда
			Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Иначе
			Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
		КонецЕсли;
		Элементы.ИспользуетсяПриЗагрузке.УстановитьДействие(
			"ПриИзменении", "Расш1_Подключаемый_ИспользуетсяПриЗагрузкеПриИзменении");
	КонецЕсли;
	Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.Алгоритм, Опции);
	Расш1_КонсольКода.СоздатьХостКонсоли(ЭтотОбъект, ЭтотОбъект, "", Элементы.Алгоритм);
	
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
	ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
	Расш1_КонсольКода.ЗаполнитьРеквизитыПоиска(
		ЭтотОбъект,
		Параметры.Расш1_ФразаПоиска,
		Параметры.Расш1_ИмяПоляПоиска,
		Параметры.Расш1_НомерСтрокиПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, "Алгоритм");
	Расш1_КонсольКодаКлиент.ПерейтиКВхождению(ЭтотОбъект);
	Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект["Конвертация"]);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	Если ИмяСобытия = Расш1_КонсольКодаКлиентСервер.ИмяСобытияПереходаКВхождению() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьПараметрыПоискаИзОповещения(ЭтотОбъект, Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_ИспользуетсяПриЗагрузкеПриИзменении(Элемент)
	
	Если Объект.ИспользуетсяПриЗагрузке Тогда
		НаправлениеАлгоритма = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
	Иначе
		НаправлениеАлгоритма = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
	КонецЕсли;
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, НаправлениеАлгоритма);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	Расш1_КонсольКодаКлиент.ВыделитьФразуПоиска(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Элементы[Команда.Имя].Заголовок);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей()
	
	ОписаниеПользовательскихОбъектовJSON = ПолучитьОписаниеПараметровJSON(
		ЭтотОбъект["Направление"], Объект.Параметры, ЭтоКонвертацияXDTO);
	Если ПустаяСтрока(ОписаниеПользовательскихОбъектовJSON) Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(Знач Направление, Параметры, Знач ЭтоКонвертацияXDTO)
	
	ОписаниеПользовательскихОбъектовJSON = "";
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если ЭтоКонвертацияXDTO И Не ПустаяСтрока(Направление) Тогда
		КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
		ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	КонецЕсли;
	
	ПараметрыАлгоритма = Параметры;
	Если Не ПустаяСтрока(ПараметрыАлгоритма) Тогда
		СписокПараметров = СтрРазделить(ПараметрыАлгоритма, ",", Ложь);
		Для Каждого Параметр Из СписокПараметров Цикл
			ПозицияЗнакаРавно = СтрНайти(Параметр, "=");
			Если ПозицияЗнакаРавно = 0 Тогда
				ПользовательскиеОбъекты.Вставить(СокрЛП(Параметр), "");
			Иначе
				ПользовательскиеОбъекты.Вставить(СокрЛП(Лев(Параметр, ПозицияЗнакаРавно - 1)), "");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

#КонецОбласти
