#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения = НСтр("ru = 'Конвертация данных не передана на текущую форму'");
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Параметры.Конвертация), ТекстСообщения);
	
	Если ЭтоКонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Алгоритм";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.Алгоритм, Опции);
		Расш1_КонсольКода.СоздатьХостКонсоли(ЭтотОбъект, ЭтотОбъект, "", Элементы.Алгоритм);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если ЭтоКонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, "Алгоритм");
		Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект["Конвертация"]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если ЭтоКонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Элементы[Команда.Имя].Заголовок);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей()
	
	ОписаниеПользовательскихОбъектовJSON = ПолучитьОписаниеПараметровJSON(ЭтотОбъект["Направление"], Объект.Параметры);
	Если ПустаяСтрока(ОписаниеПользовательскихОбъектовJSON) Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(Знач Направление, Параметры)
	
	ОписаниеПользовательскихОбъектовJSON = "";
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если Не ПустаяСтрока(Направление) Тогда
		КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
		ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	КонецЕсли;
	
	ПараметрыАлгоритма = Параметры;
	Если Не ПустаяСтрока(ПараметрыАлгоритма) Тогда
		СписокПараметров = СтрРазделить(ПараметрыАлгоритма, ",", Ложь);
		Для Каждого Параметр Из СписокПараметров Цикл
			ПозицияЗнакаРавно = СтрНайти(Параметр, "=");
			Если ПозицияЗнакаРавно = 0 Тогда
				ПользовательскиеОбъекты.Вставить(СокрЛП(Параметр), "");
			Иначе
				ПользовательскиеОбъекты.Вставить(СокрЛП(Лев(Параметр, ПозицияЗнакаРавно - 1)), "");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

#КонецОбласти
