#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКодаПередКонвертацией;

&НаКлиенте
Перем КонсольКодаПередОтложеннымЗаполнением;

&НаКлиенте
Перем КонсольКодаПослеКонвертации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.АлгоритмПередКонвертацией.Видимость = Ложь;
	Элементы.АлгоритмПередОтложеннымЗаполнением.Видимость = Ложь;
	Элементы.АлгоритмПослеКонвертации.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	ПередКонвертациейHTML = АдресКонсолиКода;
	ПередОтложеннымЗаполнениемHTML = АдресКонсолиКода;
	ПослеКонвертацииHTML = АдресКонсолиКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	// Запишем новый текст в реквизиты.
	
	Объект.АлгоритмПередКонвертацией = КонсольКодаПередКонвертацией.getText();
	
	Объект.АлгоритмПередОтложеннымЗаполнением = КонсольКодаПередОтложеннымЗаполнением.getText();
	
	Объект.АлгоритмПослеКонвертации = КонсольКодаПослеКонвертации.getText();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_ПередКонвертациейHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПередКонвертацией = Элементы.ПередКонвертациейHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередКонвертацией, Объект.АлгоритмПередКонвертацией);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередОтложеннымЗаполнениемHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПередОтложеннымЗаполнением = Элементы.ПередОтложеннымЗаполнениемHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередОтложеннымЗаполнением, Объект.АлгоритмПередОтложеннымЗаполнением);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПослеКонвертацииHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПослеКонвертации = Элементы.ПослеКонвертацииHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПослеКонвертации, Объект.АлгоритмПослеКонвертации);
	
КонецПроцедуры

#КонецОбласти