
&НаКлиенте
Процедура Расш1_КонвертацииВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПроверитьОписаниеМетаданныхКонвертации(Конвертации, ВыбраннаяСтрока);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьОписаниеМетаданныхКонвертации(Знач Конвертации, ВыбраннаяСтрока)
	
	ДеревоКонвертаций = ДанныеФормыВЗначение(Конвертации, Тип("ДеревоЗначений"));
	
	Конвертация = ДеревоКонвертаций.Строки[0].Ссылка;
	
	ОписаниеМетаданных = Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданных(Конвертация);
	Если ОписаниеМетаданных = Неопределено Тогда
		
		// Загружаем описание.
		Релиз = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация, "Конфигурация");
		Расш1_КоллекцияМетаданных.ОбновитьОписаниеМетаданных(Релиз);
		
	КонецЕсли;
	
КонецПроцедуры
