#Область СлужебныеПроцедурыИФункции

&После("ВыполнитьЗагрузку")
&НаКлиенте
Процедура Расш1_ВыполнитьЗагрузкуПосле(Команда)
	
	Если Объект.ИсточникДанных = 0 Или Объект.ТолькоОбновитьПланыОбмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИмяКаталогаЗагрузки) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлПроекта = Новый Файл(Объект.ИмяКаталогаЗагрузки);
	Расш1_НачатьПоискМодулей(ФайлПроекта.Путь, Ложь);
	Расш1_НачатьПоискМодулейРасширений();
	
КонецПроцедуры

&После("ЗавершениеПроверкиСуществованияФайла")
&НаКлиенте
Процедура Расш1_ЗавершениеПроверкиСуществованияФайлаПосле(НайденныеФайлы, ДополнительныеПараметры)
	
	Если НайденныеФайлы.Количество() = 0 Или Объект.ТолькоОбновитьПланыОбмена Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_НачатьПоискМодулей(Объект.ИмяКаталогаЗагрузки, Ложь);
	Расш1_НачатьПоискМодулейРасширений();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НачатьПоискМодулейРасширений()
	
	Если Не Объект.ЕстьРасширения Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРасширения Из Объект.Расширения Цикл
		Расш1_НачатьПоискМодулей(СтрокаРасширения.ИмяКаталогаЗагрузки, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НачатьПоискМодулей(КаталогЗагрузки, ЭтоРасширение)
	
	Если Не ЗначениеЗаполнено(КаталогЗагрузки) Тогда
		Возврат;
	КонецЕсли;
	
	Корень = КаталогЗагрузки;
	ФайлКаталога = Новый Файл(КаталогЗагрузки);
	Если Не ФайлКаталога.ЭтоКаталог() Тогда
		Корень = ФайлКаталога.Путь;
	КонецЕсли;
	
	Разделитель = ПолучитьРазделительПути();
	Корень = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Корень);
	Расш1_ЗапланироватьПоиск(КаталогЗагрузки, ЭтоРасширение, Корень, "*.bsl");
	
	Если Объект.ИсточникДанных = 0 Тогда
		Расш1_ЗапланироватьПоиск(КаталогЗагрузки, ЭтоРасширение, Корень + "CommonModules", "*.xml");
		Расш1_ЗапланироватьПоиск(КаталогЗагрузки, ЭтоРасширение, Корень + "ОбщиеМодули", "*.xml");
	Иначе
		Расш1_ЗапланироватьПоиск(
			КаталогЗагрузки,
			ЭтоРасширение,
			Корень + "src" + Разделитель + "CommonModules",
			"*.mdo");
		Расш1_ЗапланироватьПоиск(
			КаталогЗагрузки,
			ЭтоРасширение,
			Корень + "src" + Разделитель + "ОбщиеМодули",
			"*.mdo");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ЗапланироватьПоиск(КаталогЗагрузки, ЭтоРасширение, КаталогПоиска, Маска)
	
	ФайлПоиска = Новый Файл(КаталогПоиска);
	Если Не ФайлПоиска.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_УвеличитьСчетчикКаталога(КаталогЗагрузки);
	ПараметрыПоиска = Новый Структура("ЭтоРасширение, ИмяКаталога, КаталогЗагрузки", ЭтоРасширение, "", КаталогЗагрузки);
	Оповещение = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект, ПараметрыПоиска);
	НачатьПоискФайлов(Оповещение, КаталогПоиска, Маска, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_УвеличитьСчетчикКаталога(КаталогЗагрузки)
	
	СтрокиКаталога = ЗагружаемыеКаталоги.НайтиСтроки(Новый Структура("КаталогЗагрузки", КаталогЗагрузки));
	Если СтрокиКаталога.Количество() = 0 Тогда
		СтрокаКаталога = ЗагружаемыеКаталоги.Добавить();
		СтрокаКаталога.КаталогЗагрузки = КаталогЗагрузки;
		СтрокаКаталога.КоличествоФайлов = 1;
	Иначе
		СтрокиКаталога[0].КоличествоФайлов = СтрокиКаталога[0].КоличествоФайлов + 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
