#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКодаПриОтправке;

&НаКлиенте
Перем КонсольКодаПередПолучениемДанных;

&НаКлиенте
Перем КонсольКодаПриПолученниДанных;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.АлгоритмПриОтправкеДанных.Видимость = Ложь;
	Элементы.АлгоритмПередПолучениемДанных.Видимость = Ложь;
	Элементы.АлгоритмПриПолученииДанных.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	ПриОтправкеДанныхHTML = АдресКонсолиКода;
	ПередПолучениемДанныхHTML = АдресКонсолиКода;
	ПриПолученииДанныхHTML = АдресКонсолиКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	// Запишем новый текст в реквизиты.
	
	Объект.АлгоритмПриОтправкеДанных = КонсольКодаПриОтправке.getText();
	
	Объект.АлгоритмПередПолучениемДанных = КонсольКодаПередПолучениемДанных.getText();
	
	Объект.АлгоритмПриПолученииДанных = КонсольКодаПриПолученниДанных.getText();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_ПриОтправкеДанныхHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПриОтправке = Элементы.ПриОтправкеДанныхHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПриОтправке, Объект.АлгоритмПриОтправкеДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередПолучениемДанныхHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПередПолучениемДанных = Элементы.ПередПолучениемДанныхHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередПолучениемДанных, Объект.АлгоритмПередПолучениемДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриПолученииДанныхHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПриПолученниДанных = Элементы.ПриПолученииДанныхHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПриПолученниДанных, Объект.АлгоритмПриПолученииДанных);
	
КонецПроцедуры

#КонецОбласти