#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКодаПередКонвертацией;

&НаКлиенте
Перем КонсольКодаПередОтложеннымЗаполнением;

&НаКлиенте
Перем КонсольКодаПослеКонвертации;

&НаКлиенте
Перем КонсольКодаПередКонвертациейСформирован;

&НаКлиенте
Перем КонсольКодаПередОтложеннымЗаполнениемСформирован;

&НаКлиенте
Перем КонсольКодаПослеКонвертацииСформирован;

&НаКлиенте
Перем СветлаяТемаАлгоритмПередКонвертацией;

&НаКлиенте
Перем СветлаяТемаАлгоритмПередОтложеннымЗаполнением;

&НаКлиенте
Перем СветлаяТемаАлгоритмПослеКонвертации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если КонвертацияXDTO Тогда
		
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередКонвертацией, Элементы.ПередКонвертацией, ЭтотОбъект);
		
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередОтложеннымЗаполнением, Элементы.ПередОтложеннымЗаполнением, ЭтотОбъект);
		ИмяЭлементаНаправление = "Направление" + Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML";
		Элементы[ИмяЭлементаНаправление].Доступность = Ложь;
		
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеКонвертации, Элементы.ПослеКонвертации, ЭтотОбъект);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Объект.Ссылка;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
	КонецЕсли;
	
	//VanessaEditorLoad();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если КонвертацияXDTO Тогда
		
		ЭтотОбъект[Элементы.АлгоритмПередКонвертацией.Имя + "HTML"] = АдресКонсолиКода;
		ЭтотОбъект[Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML"] = АдресКонсолиКода;
		ЭтотОбъект[Элементы.АлгоритмПослеКонвертации.Имя + "HTML"] = АдресКонсолиКода;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если КонвертацияXDTO Тогда
		
		// Запишем новый текст в реквизиты.
		Объект.АлгоритмПередКонвертацией = КонсольКодаПередКонвертацией.getText();
		Объект.АлгоритмПередОтложеннымЗаполнением = КонсольКодаПередОтложеннымЗаполнением.getText();
		Объект.АлгоритмПослеКонвертации = КонсольКодаПослеКонвертации.getText();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	ПослеФормированияКонсолейКода();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АлгоритмПередКонвертациейHTMLСформирован(Элемент)
	
	КонсольКодаПередКонвертацией = Элемент.Документ.defaultView;
	
	Расш1_КонсольКода.УстановкаАтрибутовКонсолиКода(
		КонсольКодаПередКонвертацией, 
		Объект.АлгоритмПередКонвертацией, 
		КонсольКодаПередКонвертациейСформирован);
	
	ПослеФормированияКонсолейКода();
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередКонвертациейHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Расш1_КонсольКода.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередОтложеннымЗаполнениемHTMLСформирован(Элемент)
	
	КонсольКодаПередОтложеннымЗаполнением = Элемент.Документ.defaultView;
	
	Расш1_КонсольКода.УстановкаАтрибутовКонсолиКода(
		КонсольКодаПередОтложеннымЗаполнением, 
		Объект.АлгоритмПередОтложеннымЗаполнением, 
		КонсольКодаПередОтложеннымЗаполнениемСформирован);
	
	ПослеФормированияКонсолейКода();
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередОтложеннымЗаполнениемHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Расш1_КонсольКода.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПослеКонвертацииHTMLСформирован(Элемент)
	
	КонсольКодаПослеКонвертации = Элемент.Документ.defaultView;
	
	Расш1_КонсольКода.УстановкаАтрибутовКонсолиКода(
		КонсольКодаПослеКонвертации, 
		Объект.АлгоритмПослеКонвертации, 
		КонсольКодаПослеКонвертацииСформирован);
	
	ПослеФормированияКонсолейКода();
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПослеКонвертацииHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Расш1_КонсольКода.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтраницыОбработчикиПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ПередОтложеннымЗаполнением" Тогда
		
		ПолучениеАлгоритмПередОтложеннымЗаполнениемHTML(
			ЭтотОбъект.Команды.Найти("ПолучениеАлгоритмПередОтложеннымЗаполнениемHTML"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СменитьТемуАлгоритмПередКонвертациейHTML(Команда)
	Расш1_КонсольКода.СменитьТему(ЭтотОбъект, Элементы.АлгоритмПередКонвертацией.Имя + "HTML", СветлаяТемаАлгоритмПередКонвертацией);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПередКонвертациейHTML(Команда)
	КонсольКодаПередКонвертацией.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML(Команда)
	Расш1_КонсольКода.СменитьТему(ЭтотОбъект, Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML", СветлаяТемаАлгоритмПередОтложеннымЗаполнением);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПередОтложеннымЗаполнениемHTML()
	КонсольКодаПередОтложеннымЗаполнением.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура СменитьТемуАлгоритмПослеКонвертацииHTML(Команда)
	Расш1_КонсольКода.СменитьТему(ЭтотОбъект, Элементы.АлгоритмПослеКонвертации.Имя + "HTML", СветлаяТемаАлгоритмПослеКонвертации);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПослеКонвертацииHTML(Команда)
	КонсольКодаПослеКонвертации.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаАлгоритмПередКонвертациейHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеАлгоритмПередКонвертациейHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаАлгоритмПередОтложеннымЗаполнениемHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеАлгоритмПередОтложеннымЗаполнениемHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаАлгоритмПослеКонвертацииHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеАлгоритмПослеКонвертацииHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	ЗаполнитьПараметрыОбработчиков(Команда.Имя);
	
	Элементы[Команда.Имя].Родитель.Заголовок = Элементы[Команда.Имя].Заголовок;
	Элементы[Команда.Имя].Родитель.Картинка = Элементы[Команда.Имя].Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолейКода()
	
	Если КонсольКодаПередКонвертациейСформирован 
		И КонсольКодаПередОтложеннымЗаполнениемСформирован 
		И КонсольКодаПослеКонвертацииСформирован Тогда
		
		ЗначениеДоступности = Ложь;
		КонсольКодаПередКонвертацией.setReadOnly(ЗначениеДоступности);
		КонсольКодаПередОтложеннымЗаполнением.setReadOnly(ЗначениеДоступности);
		КонсольКодаПослеКонвертации.setReadOnly(ЗначениеДоступности);
		
		ЗаполнитьПараметрыОбработчиков();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыОбработчиков(ИмяКоманды = "")
	
	ОписаниеПользовательскихОбъектовJSON = ПолучитьОписаниеПараметровJSON(ИмяКоманды);
	Если ПустаяСтрока(ОписаниеПользовательскихОбъектовJSON) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОписаниеПараметровОбработчиковВоВсехКонсолях(ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеПараметровJSON(ИмяКоманды)
	
	Направление = "";
	ОписаниеПользовательскихОбъектовJSON = "";
	
	Если Не ПустаяСтрока(ИмяКоманды) Тогда
		НайденнаяКоманда = ЭтотОбъект.Команды.Найти(ИмяКоманды);
		Если НайденнаяКоманда <> Неопределено Тогда
			Направление = НайденнаяКоманда.Заголовок;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Направление) Тогда
		ЭтотОбъект["Направление"] = Направление;
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект["Направление"]) Тогда
		Возврат ОписаниеПользовательскихОбъектовJSON;
	КонецЕсли;
	
	ПользовательскиеОбъекты = Новый Структура;
	
	КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(ЭтотОбъект["Направление"]);
	ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON = 
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОписаниеПараметровОбработчиковВоВсехКонсолях(ОписаниеПараметровJSON = Неопределено)
	
	АдресОбновления = "";
	РезультатОбновления = КонсольКодаПередКонвертацией.updateMetadata(ОписаниеПараметровJSON, АдресОбновления);
	
	Если ТипЗнч(РезультатОбновления) = Тип("Булево") Тогда
		КонсольКодаПередКонвертацией.triggerSuggestions();
	Иначе
		Ошибка = РезультатОбновления.errorDescription;
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);
	КонецЕсли;
	
	РезультатОбновления = КонсольКодаПередОтложеннымЗаполнением.updateMetadata(ОписаниеПараметровJSON, АдресОбновления);
	
	Если ТипЗнч(РезультатОбновления) = Тип("Булево") Тогда
		КонсольКодаПередОтложеннымЗаполнением.triggerSuggestions();
	Иначе
		Ошибка = РезультатОбновления.errorDescription;
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);
	КонецЕсли;
	
	РезультатОбновления = КонсольКодаПослеКонвертации.updateMetadata(ОписаниеПараметровJSON, АдресОбновления);
	
	Если ТипЗнч(РезультатОбновления) = Тип("Булево") Тогда
		КонсольКодаПослеКонвертации.triggerSuggestions();
	Иначе
		Ошибка = РезультатОбновления.errorDescription;
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Клиент Тогда
	СветлаяТемаАлгоритмПередКонвертацией = Истина;
	СветлаяТемаАлгоритмПередОтложеннымЗаполнением = Истина;
	СветлаяТемаАлгоритмПослеКонвертации = Истина;
	КонсольКодаПередКонвертациейСформирован = Ложь;
	КонсольКодаПередОтложеннымЗаполнениемСформирован = Ложь;
	КонсольКодаПослеКонвертацииСформирован = Ложь;
#КонецЕсли
