#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКодаПередКонвертацией;

&НаКлиенте
Перем КонсольКодаПередОтложеннымЗаполнением;

&НаКлиенте
Перем КонсольКодаПослеКонвертации;

&НаКлиенте
Перем СветлаяТемаАлгоритмПередКонвертацией;

&НаКлиенте
Перем СветлаяТемаАлгоритмПередОтложеннымЗаполнением;

&НаКлиенте
Перем СветлаяТемаАлгоритмПослеКонвертации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередКонвертацией, Элементы.ПередКонвертацией, ЭтотОбъект);
	Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередОтложеннымЗаполнением, Элементы.ПередОтложеннымЗаполнением, ЭтотОбъект);
	Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеКонвертации, Элементы.ПослеКонвертации, ЭтотОбъект);
	
	// Создаем реквизит для хранения описания метаданных. Нужно хранить т.к. мы подаем это описание потом при формировании bsl консолей.
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "ОписаниеМетаданныхJSON");
	
	// Заполним реквизит метаданными конфигурации.
	Если Не Объект.Конфигурация.Пустая() Тогда
		ЭтотОбъект["ОписаниеМетаданныхJSON"] = ПолучитьОписаниеМетаданныхJSON(Объект.Конфигурация);
	КонецЕсли;
	
	//VanessaEditorLoad();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	ЭтотОбъект[Элементы.АлгоритмПередКонвертацией.Имя + "HTML"] = АдресКонсолиКода;
	ЭтотОбъект[Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML"] = АдресКонсолиКода;
	ЭтотОбъект[Элементы.АлгоритмПослеКонвертации.Имя + "HTML"] = АдресКонсолиКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	// Запишем новый текст в реквизиты.
	Объект.АлгоритмПередКонвертацией = КонсольКодаПередКонвертацией.getText();
	Объект.АлгоритмПередОтложеннымЗаполнением = КонсольКодаПередОтложеннымЗаполнением.getText();
	Объект.АлгоритмПослеКонвертации = КонсольКодаПослеКонвертации.getText();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АлгоритмПередКонвертациейHTMLСформирован(Элемент)
	
	КонсольКодаПередКонвертацией = Элемент.Документ.defaultView;
	//КонсольКодаПередКонвертацией.createVanessaEditor("", "bsl");
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередКонвертацией, Объект.АлгоритмПередКонвертацией);
	КонсольКодаПередКонвертацией.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередКонвертациейHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Расш1_КонсольКода.ПриНажатии(ЭтотОбъект, ДанныеСобытия);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередОтложеннымЗаполнениемHTMLСформирован(Элемент)
	
	КонсольКодаПередОтложеннымЗаполнением = Элемент.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередОтложеннымЗаполнением, Объект.АлгоритмПередОтложеннымЗаполнением);
	КонсольКодаПередОтложеннымЗаполнением.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередОтложеннымЗаполнениемHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Расш1_КонсольКода.ПриНажатии(ЭтотОбъект, ДанныеСобытия);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПослеКонвертацииHTMLСформирован(Элемент)
	
	КонсольКодаПослеКонвертации = Элемент.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПослеКонвертации, Объект.АлгоритмПослеКонвертации);
	КонсольКодаПослеКонвертации.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПослеКонвертацииHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Расш1_КонсольКода.ПриНажатии(ЭтотОбъект, ДанныеСобытия);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СменитьТемуАлгоритмПередКонвертациейHTML(Команда)
	Расш1_КонсольКода.СменитьТему(ЭтотОбъект, Элементы.АлгоритмПередКонвертацией.Имя + "HTML", СветлаяТемаАлгоритмПередКонвертацией);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПередКонвертациейHTML(Команда)
	КонсольКодаПередКонвертацией.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML(Команда)
	Расш1_КонсольКода.СменитьТему(ЭтотОбъект, Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML", СветлаяТемаАлгоритмПередОтложеннымЗаполнением);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПередОтложеннымЗаполнениемHTML()
	КонсольКодаПередОтложеннымЗаполнением.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура СменитьТемуАлгоритмПослеКонвертацииHTML(Команда)
	Расш1_КонсольКода.СменитьТему(ЭтотОбъект, Элементы.АлгоритмПослеКонвертации.Имя + "HTML", СветлаяТемаАлгоритмПослеКонвертации);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПослеКонвертацииHTML(Команда)
	КонсольКодаПослеКонвертации.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаАлгоритмПередКонвертациейHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеАлгоритмПередКонвертациейHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаАлгоритмПередОтложеннымЗаполнениемHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеАлгоритмПередОтложеннымЗаполнениемHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаАлгоритмПослеКонвертацииHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеАлгоритмПослеКонвертацииHTML(Команда)
	ПриИзмененииНаправления(Команда);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеМетаданныхJSON(Знач Конфигурация, Знач Направление = "")
	
	ОписаниеМетаданных = Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданных(Конфигурация);
	
	Если Не ПустаяСтрока(Направление) Тогда
		КомпонентыОбмена = Справочники.Конфигурации.ПолучитьОписаниеКомпонентыОбмена(Направление);
		ПользовательскиеОбъекты = Новый Структура;
		ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
		ОписаниеМетаданных.Вставить("customObjects", ПользовательскиеОбъекты);
	КонецЕсли;
	
	ОписаниеМетаданныхJSON = Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеМетаданных);
	Возврат ОписаниеМетаданныхJSON;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	ОбновитьОписаниеМетаданныхПоНаправлению(Команда.Имя);
	ОбновитьОписаниеМетаданныхВоВсехКонсоляхОбработчиков();
	Элементы[Команда.Имя].Родитель.Заголовок = Элементы[Команда.Имя].Заголовок;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОписаниеМетаданныхПоНаправлению(ИмяКоманды)
	
	Направление = ЭтотОбъект.Команды.Найти(ИмяКоманды).Заголовок;
	ЭтотОбъект["ОписаниеМетаданныхJSON"] = ПолучитьОписаниеМетаданныхJSON(Объект.Конфигурация, Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеМетаданныхВоВсехКонсоляхОбработчиков()
	
	КонсольКодаПередКонвертацией.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	КонсольКодаПередОтложеннымЗаполнением.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	КонсольКодаПослеКонвертации.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	
КонецПроцедуры

#КонецОбласти

#Если Клиент Тогда
	СветлаяТемаАлгоритмПередКонвертацией = Истина;
	СветлаяТемаАлгоритмПередОтложеннымЗаполнением = Истина;
	СветлаяТемаАлгоритмПослеКонвертации = Истина;
#КонецЕсли
