#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если КонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриОбработке";
		Опции.ПоказыватьНаправление = Ложь;
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриОбработке, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ВыборкаДанных";
		Опции.ПоказыватьНаправление = Ложь;
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмВыборкаДанных, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.ОбработчикиСобытийXDTO, "СтраницыОбработчикиXDTO", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.СтраницыОбработчикиXDTO.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыОбработчикиXDTOПриСменеСтраницы");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если КонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		ПослеФормированияКонсолей();
		Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект["Конвертация"]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если КонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ОбработчикиСобытийXDTO" Тогда
		ПослеФормированияКонсолей("Страница_ПриОбработке");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыОбработчикиXDTOПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

&После("ИспользоватьДляОтправкиПриИзменении")
&НаКлиенте
Процедура Расш1_ИспользоватьДляОтправкиПриИзмененииПосле(Элемент)
	ПослеФормированияКонсолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Не Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "ОбработчикиСобытийXDTO" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.СтраницыОбработчикиXDTO.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Если ИмяСтраницы = "Страница_ВыборкаДанных" И Не Объект.ИспользоватьДляОтправки Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	
	ИспользованиеПКО = ЗаполнитьПараметрИспользованиеПКО(ИмяСтраницы);
	
	ОписаниеПользовательскихОбъектовJSON =
		ПолучитьОписаниеПараметровJSON(
			ЭтотОбъект["Конвертация"], Объект.ОбъектВыборки, Объект.ИспользоватьДляОтправки, ИмяСтраницы, ИспользованиеПКО);
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(
		Знач Конвертация, Знач ОбъектКонфигурации, Знач ИспользоватьДляОтправки, Знач ИмяСтраницы, Знач ИспользованиеПКО)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если ИспользоватьДляОтправки Тогда
		Направление = "Отправка";
	Иначе
		Направление = "Получение";
	КонецЕсли;
	
	Если Не ПустаяСтрока(Направление) Тогда
		КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
		ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОбъектКонфигурации) И ИспользоватьДляОтправки Тогда
		ДанныеИБ = Расш1_КоллекцияМетаданных.ПолучитьОписаниеДанныеИБ(ОбъектКонфигурации);
		ПользовательскиеОбъекты.Вставить("ДанныеИБ", ДанныеИБ);
	КонецЕсли;
	
	Если ИспользованиеПКО.Количество() > 0 Тогда
		ИспользованиеПКОJson = Расш1_КоллекцияМетаданных.ПолучитьОписаниеИспользованиеПКО(ИспользованиеПКО);
		ПользовательскиеОбъекты.Вставить("ИспользованиеПКО", ИспользованиеПКОJson);
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьПараметрИспользованиеПКО(ИмяСтраницы)
	
	ИспользованиеПКО = Новый Структура;
	
	Если Элементы.СтраницыОбработчикиXDTO.ТекущаяСтраница.Имя = "Страница_ПриОбработке"
		И ИспользоватьНесколькоПравилКонвертации Тогда
		
		Для Каждого СтрокаПравил Из Объект.ПравилаКонвертацииОбъектов Цикл
			Если Не ПустаяСтрока(СтрокаПравил.ПравилоКонвертацииОбъекта) Тогда
				ИспользованиеПКО.Вставить(СтрокаПравил.ПравилоКонвертацииОбъекта, Истина);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Элементы.СтраницыОбработчикиXDTO.ТекущаяСтраница.Имя = "Страница_ПриОбработке" Тогда
		Если Не ПустаяСтрока(Объект.ПравилоКонвертацииОбъекта) Тогда
			ИспользованиеПКО.Вставить(Объект.ПравилоКонвертацииОбъекта, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИспользованиеПКО;
	
КонецФункции

#КонецОбласти
