#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения = НСтр("ru = 'Конвертация данных не передана на текущую форму'");
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Параметры.Конвертация), ТекстСообщения);
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Если КонвертацияXDTO Тогда
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ПриОбработке";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПриОбработке, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "Страница_ВыборкаДанных";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмВыборкаДанных, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.ОбработчикиСобытийXDTO, "СтраницыОбработчикиXDTO", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.СтраницыОбработчикиXDTO.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыОбработчикиXDTOПриСменеСтраницы");
		
	Иначе
		
		Отправка = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередОбработкойПравила, "ПередОбработкой", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередВыгрузкойОбъекта, "ПередВыгрузкой", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеВыгрузкиОбъекта, "ПослеВыгрузки", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеОбработкиПравила, "ПослеОбработки", Отправка);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.ОбработчикиСобытийXML, "СтраницыОбработчикиXML", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Параметры.Конвертация;
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.СтраницыОбработчикиXML.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыОбработчикиXMLПриСменеСтраницы");
		
	КонецЕсли;
	
	Расш1_КонсольКода.ЗаполнитьРеквизитыПоиска(
		ЭтотОбъект,
		Параметры.Расш1_ФразаПоиска,
		Параметры.Расш1_ИмяПоляПоиска,
		Параметры.Расш1_НомерСтрокиПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	ПослеФормированияКонсолей();
	Расш1_КонсольКодаКлиент.ПерейтиКВхождению(ЭтотОбъект);
	Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект["Конвертация"]);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	Если ИмяСобытия = Расш1_КонсольКодаКлиентСервер.ИмяСобытияПереходаКВхождению() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьПараметрыПоискаИзОповещения(ЭтотОбъект, Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ОбработчикиСобытийXDTO" Тогда
		ПослеФормированияКонсолей("Страница_ПриОбработке");
	ИначеЕсли ТекущаяСтраница.Имя = "ОбработчикиСобытийXML" Тогда
		ПослеФормированияКонсолей("ПередОбработкой");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыОбработчикиXMLПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыОбработчикиXDTOПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	Расш1_КонсольКодаКлиент.ВыделитьФразуПоиска(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

&После("ИспользоватьДляОтправкиПриИзменении")
&НаКлиенте
Процедура Расш1_ИспользоватьДляОтправкиПриИзмененииПосле(Элемент)
	ПослеФормированияКонсолей();
КонецПроцедуры

&После("ОбъектВыборкиПриИзменении")
&НаКлиенте
Процедура Расш1_ОбъектВыборкиПриИзмененииПосле(Элемент)
	ПослеФормированияКонсолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Элементы[Команда.Имя].Заголовок);
		ПослеФормированияКонсолей();
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подменю командной панели к этому моменту уже закрыто.
//
&НаКлиенте
Процедура Расш1_Подключаемый_ПоказатьЗакладки()
	
	Расш1_КонсольКодаКлиент.ПоказатьСписокЗакладокСейчас(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если Не КонвертацияXDTO Тогда
		Расш1_ПоказатьКонсольXML(ИмяСтраницы);
		Возврат;
	КонецЕсли;
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "ОбработчикиСобытийXDTO" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.СтраницыОбработчикиXDTO.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Если ИмяСтраницы = "Страница_ВыборкаДанных" И Не Объект.ИспользоватьДляОтправки Тогда
		Возврат;
	КонецЕсли;
	
	Направление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
	Если Объект.ИспользоватьДляОтправки Тогда
		Направление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
	КонецЕсли;
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Направление);
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	
	ГруппаНаправления = Элементы.Найти(Расш1_КонсольКодаКлиентСервер.ИмяГруппыНаправленияХоста());
	Если ГруппаНаправления <> Неопределено Тогда
		ГруппаНаправления.Доступность = Ложь;
	КонецЕсли;
	
	ИспользованиеПКО = ЗаполнитьПараметрИспользованиеПКО(ИмяСтраницы);
	
	ОписаниеПользовательскихОбъектовJSON =
		ПолучитьОписаниеПараметровJSON(
			ЭтотОбъект["Конвертация"], Объект.ОбъектВыборки, Объект.ИспользоватьДляОтправки, ИмяСтраницы, ИспользованиеПКО);
	
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(
		Знач Конвертация, Знач ОбъектКонфигурации, Знач ИспользоватьДляОтправки, Знач ИмяСтраницы, Знач ИспользованиеПКО)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	Если ИспользоватьДляОтправки Тогда
		Направление = "Отправка";
	Иначе
		Направление = "Получение";
	КонецЕсли;
	
	Если Не ПустаяСтрока(Направление) Тогда
		КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
		ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОбъектКонфигурации) И ИспользоватьДляОтправки Тогда
		ДанныеИБ = Расш1_КоллекцияМетаданных.ПолучитьОписаниеДанныеИБ(ОбъектКонфигурации);
		ПользовательскиеОбъекты.Вставить("ДанныеИБ", ДанныеИБ);
	КонецЕсли;
	
	Если ИспользованиеПКО.Количество() > 0 Тогда
		ИспользованиеПКОJson = Расш1_КоллекцияМетаданных.ПолучитьОписаниеИспользованиеПКО(ИспользованиеПКО);
		ПользовательскиеОбъекты.Вставить("ИспользованиеПКО", ИспользованиеПКОJson);
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьПараметрИспользованиеПКО(ИмяСтраницы)
	
	ИспользованиеПКО = Новый Структура;
	
	Если Элементы.СтраницыОбработчикиXDTO.ТекущаяСтраница.Имя = "Страница_ПриОбработке"
		И ИспользоватьНесколькоПравилКонвертации Тогда
		
		Для Каждого СтрокаПравил Из Объект.ПравилаКонвертацииОбъектов Цикл
			Если Не ПустаяСтрока(СтрокаПравил.ПравилоКонвертацииОбъекта) Тогда
				ИспользованиеПКО.Вставить(СтрокаПравил.ПравилоКонвертацииОбъекта, Истина);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Элементы.СтраницыОбработчикиXDTO.ТекущаяСтраница.Имя = "Страница_ПриОбработке" Тогда
		Если Не ПустаяСтрока(Объект.ПравилоКонвертацииОбъекта) Тогда
			ИспользованиеПКО.Вставить(Объект.ПравилоКонвертацииОбъекта, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИспользованиеПКО;
	
КонецФункции

&НаСервере
Процедура Расш1_ЗарегистрироватьАлгоритмСтраницы(ЭлементАлгоритма, ИмяСтраницы, Направление)
	
	Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
	Опции.ИмяСтраницы = ИмяСтраницы;
	Опции.ПоказыватьНаправление = Ложь;
	Опции.АвтоНаправление = Направление;
	Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, ЭлементАлгоритма, Опции);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПоказатьКонсольXML(ИмяСтраницы)
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "ОбработчикиСобытийXML" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.СтраницыОбработчикиXML.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	Если ПустаяСтрока(ЭтотОбъект["Направление"]) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектовJSON = Расш1_ОписаниеПараметровСтраницыXML(
		ЭтотОбъект["Конвертация"], ИмяСтраницы, Объект.ОбъектВыборки);
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Расш1_ОписаниеПараметровСтраницыXML(Знач Конвертация, Знач ИмяСтраницы, Знач ОбъектВыборки)
	
	Возврат Расш1_КоллекцияМетаданных.ОписаниеПараметровСтраницыJSON(
		Расш1_ИменаПараметровСтраницыXML(ИмяСтраницы), Конвертация, ОбъектВыборки, "Объект");
	
КонецФункции

&НаСервереБезКонтекста
Функция Расш1_ИменаПараметровСтраницыXML(ИмяСтраницы)
	
	Страницы = Новый Соответствие;
	Страницы.Вставить("ПередОбработкой", "Отказ,Параметры,ИмяПКО,Правило,ИсходящиеДанные,ВыборкаДанных");
	Страницы.Вставить("ПередВыгрузкой", "Отказ,Параметры,ИмяПКО,Правило,ВходящиеДанные,ИсходящиеДанные,Объект");
	Страницы.Вставить("ПослеВыгрузки", "Параметры,Объект,ИмяПКО,ВходящиеДанные,ИсходящиеДанные,УзелСсылки");
	Страницы.Вставить("ПослеОбработки", "Параметры,ИмяПКО,Правило,ИсходящиеДанные");
	
	Имена = Страницы.Получить(ИмяСтраницы);
	Если Имена = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Имена;
	
КонецФункции

#КонецОбласти
