#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если КонвертацияXDTO Тогда
		
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередКонвертацией, Элементы.ПередКонвертацией, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередОтложеннымЗаполнением, Элементы.ПередОтложеннымЗаполнением, ЭтотОбъект);
		Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеКонвертации, Элементы.ПослеКонвертации, ЭтотОбъект);
		
		ИмяЭлементаНаправление = "Направление" + Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML";
		Элементы[ИмяЭлементаНаправление].Доступность = Ложь;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Объект.Ссылка;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если КонвертацияXDTO Тогда
		Расш1_НазначитьКонсольТекущейСтраницы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если КонвертацияXDTO Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаКонвертацияXDTO"
		И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей("ПередКонвертацией");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ГруппаДанныеКонвертацииXDTOПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей("ПередКонвертацией");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтраницыОбработчикиПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
	
	Если ТекущаяСтраница.Имя = "ПередОтложеннымЗаполнением" Тогда
		ПриИзмененииНаправления(Команды.Найти("ПолучениеАлгоритмПередОтложеннымЗаполнениемHTML"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Направление = Элементы[Команда.Имя].Заголовок;
	Элементы[Команда.Имя].Родитель.Заголовок = Направление;
	Элементы[Команда.Имя].Родитель.Картинка = Элементы[Команда.Имя].Картинка;
	
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "СтраницаКонвертацияXDTO"
		Или Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя <> "СтраницаОбработчики" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Расш1_НазначитьКонсольСтраницы(ИмяСтраницы);
	
	Если ПустаяСтрока(ЭтотОбъект["Направление"]) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектовJSON = ПолучитьОписаниеПараметровJSON(ЭтотОбъект["Направление"]);
	ИмяЭлементаHTML = Расш1_ИмяЭлементаHTMLСтраницы(ИмяСтраницы);
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(ЭтотОбъект, ИмяЭлементаHTML, ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольТекущейСтраницы()
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаКонвертацияXDTO"
		И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		Расш1_НазначитьКонсольСтраницы(Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольСтраницы(ИмяСтраницы)
	
	ИмяЭлементаАлгоритма = Расш1_ИмяЭлементаАлгоритмаСтраницы(ИмяСтраницы);
	Если Не ПустаяСтрока(ИмяЭлементаАлгоритма) Тогда
		Расш1_КонсольКодаКлиент.НазначитьРеквизитуКонсолиАдрес(ЭтотОбъект, ИмяЭлементаАлгоритма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Расш1_ИмяЭлементаАлгоритмаСтраницы(ИмяСтраницы)
	
	Если ИмяСтраницы = "ПередКонвертацией" Тогда
		Возврат Элементы.АлгоритмПередКонвертацией.Имя;
	ИначеЕсли ИмяСтраницы = "ПередОтложеннымЗаполнением" Тогда
		Возврат Элементы.АлгоритмПередОтложеннымЗаполнением.Имя;
	ИначеЕсли ИмяСтраницы = "ПослеКонвертации" Тогда
		Возврат Элементы.АлгоритмПослеКонвертации.Имя;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция Расш1_ИмяЭлементаHTMLСтраницы(ИмяСтраницы)
	
	ИмяЭлементаАлгоритма = Расш1_ИмяЭлементаАлгоритмаСтраницы(ИмяСтраницы);
	Если ПустаяСтрока(ИмяЭлементаАлгоритма) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Расш1_КонсольКодаКлиентСервер.ИмяЭлементаHTML(ИмяЭлементаАлгоритма);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(Знач Направление)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
	ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

#КонецОбласти
