#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если КонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередКонвертацией";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередКонвертацией, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередОтложеннымЗаполнением";
		Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередОтложеннымЗаполнением, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПослеКонвертации";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеКонвертации, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередОбработкойУдаления";
		Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередОбработкойУдаления, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.СтраницаОбработчики, "СтраницыОбработчики", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Объект.Ссылка;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.ГруппаДанныеКонвертацииXDTO.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_ГруппаДанныеКонвертацииXDTOПриСменеСтраницы");
		Элементы.СтраницыОбработчики.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыОбработчикиПриСменеСтраницы");
		УстановитьДействие("ОбработкаОповещения", "Расш1_Подключаемый_ОбработкаОповещения");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если КонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Расш1_НазначитьКонсольТекущейСтраницы();
		Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект["Конвертация"]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если КонвертацияXDTO И Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаКонвертацияXDTO"
		И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей("ПередКонвертацией");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ГруппаДанныеКонвертацииXDTOПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей("ПередКонвертацией");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Элементы[Команда.Имя].Заголовок);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "СтраницаКонвертацияXDTO"
		Или Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя <> "СтраницаОбработчики" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	
	Если ИмяСтраницы = "ПередОтложеннымЗаполнением"
		Или ИмяСтраницы = "ПередОбработкойУдаления" Тогда
		Расш1_КонсольКодаКлиент.УстановитьНаправление(
			ЭтотОбъект, Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение());
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект["Направление"]) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектовJSON = ПолучитьОписаниеПараметровJSON(ЭтотОбъект["Направление"]);
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольТекущейСтраницы()
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаКонвертацияXDTO"
		И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей(Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(Знач Направление)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
	ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

#КонецОбласти
