// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКонвертации = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаКонвертации();
	ИмяРеквизитаНаправления = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаНаправления();
	
	Если КонвертацияXDTO Тогда
		
		Получение = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередКонвертацией";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередКонвертацией, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередОтложеннымЗаполнением";
		Опции.АвтоНаправление = Получение;
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередОтложеннымЗаполнением, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПослеКонвертации";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеКонвертации, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередОбработкойУдаления";
		Опции.АвтоНаправление = Получение;
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередОбработкойУдаления, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.СтраницаОбработчики, "СтраницыОбработчики", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, ИмяРеквизитаКонвертации, "СправочникСсылка.Конвертации");
		ЭтотОбъект[ИмяРеквизитаКонвертации] = Объект.Ссылка;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, ИмяРеквизитаНаправления, "Строка");
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.ГруппаДанныеКонвертацииXDTO.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_ГруппаДанныеКонвертацииXDTOПриСменеСтраницы");
		Элементы.СтраницыОбработчики.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыОбработчикиПриСменеСтраницы");
		УстановитьДействие("ОбработкаОповещения", "Расш1_Подключаемый_ОбработкаОповещения");
		
	Иначе
		
		Отправка = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
		Получение = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПослеЗагрузкиПравилОбмена, "ПослеЗагрузкиПравилОбмена", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередВыгрузкойДанных, "ПередВыгрузкойДанных", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередПолучениемИзмененныхОбъектов, "ПередПолучениемИзмененных", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередВыгрузкойОбъекта, "ПередВыгрузкойОбъекта", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередОтправкойИнформацииОбУдалении, "ПередОтправкойУдаления", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередКонвертациейОбъекта, "ПередКонвертациейОбъекта", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеВыгрузкиОбъекта, "ПослеВыгрузкиОбъекта", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеВыгрузкиДанных, "ПослеВыгрузкиДанных", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередЗагрузкойДанных, "ПередЗагрузкойДанных", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПослеЗагрузкиПараметров, "ПослеЗагрузкиПараметров", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПослеПолученияИнформацииОбУзлахОбмена, "ПослеПолученияУзловОбмена", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередЗагрузкойОбъекта, "ПередЗагрузкойОбъекта", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПриПолученииИнформацииОбУдалении, "ПриПолученииУдаления", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПослеЗагрузкиОбъекта, "ПослеЗагрузкиОбъекта", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеЗагрузкиДанных, "ПослеЗагрузкиДанных", Получение);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.СтраницаКонвертацияXML, "ОбработчикиXML", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, ИмяРеквизитаКонвертации, "СправочникСсылка.Конвертации");
		ЭтотОбъект[ИмяРеквизитаКонвертации] = Объект.Ссылка;
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, ИмяРеквизитаНаправления, "Строка");
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.ОбработчикиXML.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_ОбработчикиXMLПриСменеСтраницы");
		УстановитьДействие("ОбработкаОповещения", "Расш1_Подключаемый_ОбработкаОповещения");
		
	КонецЕсли;
	
	Расш1_КонсольКода.ЗаполнитьРеквизитыПоиска(
		ЭтотОбъект,
		Параметры.Расш1_ФразаПоиска,
		Параметры.Расш1_ИмяПоляПоиска,
		Параметры.Расш1_НомерСтрокиПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если КонвертацияXDTO Тогда
		Расш1_СтраницыОбработчиковКлиент.АктивироватьЕдинственныйЗаполненныйОбработчик(
			Элементы.СтраницыОбработчики, Объект);
	Иначе
		Расш1_СтраницыОбработчиковКлиент.АктивироватьЕдинственныйЗаполненныйОбработчик(
			Элементы.ОбработчикиXML, Объект);
	КонецЕсли;
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_НазначитьКонсольТекущейСтраницы();
	Расш1_КонсольКодаКлиент.ПерейтиКВхождению(ЭтотОбъект);
	ИмяРеквизитаКонвертации = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаКонвертации();
	Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект[ИмяРеквизитаКонвертации]);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия) Тогда
		Расш1_ПослеФормированияКонсолей();
	КонецЕсли;
	Если ИмяСобытия = Расш1_КонсольКодаКлиентСервер.ИмяСобытияПереходаКВхождению() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьПараметрыПоискаИзОповещения(ЭтотОбъект, Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик смены основной страницы формы.
//
// Параметры:
//  Элемент - ГруппаФормы - группа страниц.
//  ТекущаяСтраница - ГруппаФормы - выбранная страница.
//
&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаКонвертацияXDTO"
		И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		Расш1_ПослеФормированияКонсолей("ПередКонвертацией");
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаКонвертацияXML" Тогда
		Расш1_ПослеФормированияКонсолей(Элементы.ОбработчикиXML.ТекущаяСтраница.Имя);
	Иначе
		ВызватьИсключение "Расш1_Подключаемый_СтраницыПриСменеСтраницы - не обработано условие";
	КонецЕсли;
	
КонецПроцедуры

// Обработчик смены страницы обработчиков XML.
//
// Параметры:
//  Элемент - ГруппаФормы - группа страниц.
//  ТекущаяСтраница - ГруппаФормы - выбранная страница.
//
&НаКлиенте
Процедура Расш1_Подключаемый_ОбработчикиXMLПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Расш1_ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
	
КонецПроцедуры

// Обработчик смены страницы данных конвертации XDTO.
//
// Параметры:
//  Элемент - ГруппаФормы - группа страниц.
//  ТекущаяСтраница - ГруппаФормы - выбранная страница.
//
&НаКлиенте
Процедура Расш1_Подключаемый_ГруппаДанныеКонвертацииXDTOПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		Расш1_ПослеФормированияКонсолей("ПередКонвертацией");
	КонецЕсли;
	
КонецПроцедуры

// Обработчик смены страницы обработчиков XDTO.
//
// Параметры:
//  Элемент - ГруппаФормы - группа страниц.
//  ТекущаяСтраница - ГруппаФормы - выбранная страница.
//
&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Расш1_ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
	
КонецПроцедуры

// Обработчик события ДокументСформирован поля HTML консоли.
//
// Параметры:
//  Элемент - ПолеФормы - поле HTML консоли.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	Расш1_ПослеФормированияКонсолей();
	Расш1_КонсольКодаКлиент.ВыделитьФразуПоиска(ЭтотОбъект);
	
КонецПроцедуры

// Обработчик события ПриНажатии поля HTML консоли.
//
// Параметры:
//  Элемент - ПолеФормы - поле HTML консоли.
//  ДанныеСобытия - ФиксированнаяСтруктура - данные события.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

// Обработчик команд консоли.
//
// Параметры:
//  Команда - КомандаФормы - выполняемая команда.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		Расш1_ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

// Подменю командной панели к этому моменту уже закрыто.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_ПоказатьЗакладки()
	
	Расш1_КонсольКодаКлиент.ПоказатьСписокЗакладокСейчас(ЭтотОбъект);
	
КонецПроцедуры

// Устанавливает направление по заголовку кнопки команды.
//
// Параметры:
//  Команда - КомандаФормы, Неопределено - команда направления.
//
&НаКлиенте
Процедура Расш1_ПриИзмененииНаправления(Команда)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = Команда.Имя;
	КнопкаКоманды = Элементы[ИмяКоманды]; // КнопкаФормы
	ЗаголовокКоманды = КнопкаКоманды.Заголовок;
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, ЗаголовокКоманды);
	Расш1_ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если Не КонвертацияXDTO Тогда
		Расш1_ПоказатьКонсольXML(ИмяСтраницы);
		Возврат;
	КонецЕсли;
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "СтраницаКонвертацияXDTO"
		Или Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя <> "СтраницаОбработчики" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	
	Если ИмяСтраницы = "ПередОтложеннымЗаполнением"
		Или ИмяСтраницы = "ПередОбработкойУдаления" Тогда
		Получение = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Получение);
	КонецЕсли;
	
	ИмяРеквизитаНаправления = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаНаправления();
	Направление = ЭтотОбъект[ИмяРеквизитаНаправления]; // Строка
	Если ПустаяСтрока(Направление) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектовJSON = Расш1_ПолучитьОписаниеПараметровJSON(Направление);
	ИмяХоста = Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли();
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(ЭтотОбъект, ИмяХоста, ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольТекущейСтраницы()
	
	ИмяСтраницыФормы = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	Если КонвертацияXDTO Тогда
		ЭтоСтраницаОбработчиковXDTO = ИмяСтраницыФормы = "СтраницаКонвертацияXDTO"
			И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики";
		Если ЭтоСтраницаОбработчиковXDTO Тогда
			Расш1_ПослеФормированияКонсолей(Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыФормы = "СтраницаКонвертацияXML" Тогда
		Расш1_ПослеФормированияКонсолей(Элементы.ОбработчикиXML.ТекущаяСтраница.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПоказатьКонсольXML(ИмяСтраницы)
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "СтраницаКонвертацияXML" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.ОбработчикиXML.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	ИмяРеквизитаНаправления = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаНаправления();
	Направление = ЭтотОбъект[ИмяРеквизитаНаправления]; // Строка
	Если ПустаяСтрока(Направление) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКонвертации = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаКонвертации();
	Конвертация = ЭтотОбъект[ИмяРеквизитаКонвертации]; // СправочникСсылка.Конвертации
	ОписаниеПользовательскихОбъектовJSON = Расш1_ОписаниеПараметровСтраницыXML(Конвертация, ИмяСтраницы);
	ИмяХоста = Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли();
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(ЭтотОбъект, ИмяХоста, ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

// Описание параметров обработчика конвертации XDTO для подсказок консоли.
//
// Параметры:
//  Направление - Строка - Отправка или Получение.
//
// Возвращаемое значение:
//  Строка - JSON для updateMetadata.
//
&НаСервереБезКонтекста
Функция Расш1_ПолучитьОписаниеПараметровJSON(Знач Направление)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
	ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

&НаСервере
Процедура Расш1_ЗарегистрироватьАлгоритмСтраницы(ЭлементАлгоритма, ИмяСтраницы, Направление)
	
	Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
	Опции.ИмяСтраницы = ИмяСтраницы;
	Опции.ПоказыватьНаправление = Ложь;
	Опции.АвтоНаправление = Направление;
	Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, ЭлементАлгоритма, Опции);
	
КонецПроцедуры

// Описание параметров обработчика конвертации XML для подсказок консоли.
//
// Параметры:
//  Конвертация - СправочникСсылка.Конвертации - текущая конвертация.
//  ИмяСтраницы - Строка - имя страницы обработчика.
//
// Возвращаемое значение:
//  Строка - JSON для updateMetadata.
//
&НаСервереБезКонтекста
Функция Расш1_ОписаниеПараметровСтраницыXML(Знач Конвертация, Знач ИмяСтраницы)
	
	ИменаПараметров = Расш1_ИменаПараметровСтраницыXML(ИмяСтраницы);
	Возврат Расш1_КоллекцияМетаданных.ОписаниеПараметровСтраницыJSON(ИменаПараметров, Конвертация, "", "");
	
КонецФункции

&НаСервереБезКонтекста
Функция Расш1_ИменаПараметровСтраницыXML(ИмяСтраницы)
	
	ИменаПередКонвертацией = Новый Массив; // Массив из Строка
	ИменаПередКонвертацией.Добавить("Параметры,Источник,Приемник,ВходящиеДанные,ИсходящиеДанные");
	ИменаПередКонвертацией.Добавить("ИмяПКО,ПКО,ВыгруженныеОбъекты,Отказ,КлючВыгружаемыхДанных");
	ИменаПередКонвертацией.Добавить("ЗапоминатьВыгруженные,НеЗапоминатьВыгруженные,НеЗамещатьОбъектПриЗагрузке");
	ИменаПередКонвертацией.Добавить("НеСоздаватьЕслиНеНайден,ВсеОбъектыВыгружены,ТолькоПолучитьУзелСсылки");
	ИменаПередКонвертацией.Добавить("РегистрироватьОбъектНаУзлеОтправителе,РежимЗаписи,РежимПроведения");
	ИменаПередКонвертациейСтрокой = СтрСоединить(ИменаПередКонвертацией, ",");
	ИменаПередЗагрузкой = СтрШаблон("%1,%2",
		"Отказ,Нпп,Источник,ИмяПравила,Правило,ГенерироватьНовыйНомерИлиКодЕслиНеУказан",
		"ТипОбъектаСтрокой,ТипОбъекта,НеЗамещатьОбъект,РежимЗаписи,РежимПроведения");
	
	Страницы = Новый Соответствие;
	Страницы.Вставить("ПослеЗагрузкиПравилОбмена", "Параметры");
	Страницы.Вставить("ПередВыгрузкойДанных", "Отказ,Параметры");
	Страницы.Вставить("ПередПолучениемИзмененных", "Параметры,Получатель,УзелДляФоновогоОбмена");
	Страницы.Вставить("ПередВыгрузкойОбъекта",
		"Отказ,Параметры,ИмяПКО,Правило,ВходящиеДанные,ИсходящиеДанные,Объект");
	Страницы.Вставить("ПередОтправкойУдаления", "Ссылка,Отказ");
	Страницы.Вставить("ПередКонвертациейОбъекта", ИменаПередКонвертациейСтрокой);
	Страницы.Вставить("ПослеВыгрузкиОбъекта", "Параметры,Объект,ИмяПКО,ВходящиеДанные,ИсходящиеДанные,УзелСсылки");
	Страницы.Вставить("ПослеВыгрузкиДанных", "Параметры");
	Страницы.Вставить("ПередЗагрузкойДанных", "Отказ,Параметры");
	Страницы.Вставить("ПослеЗагрузкиПараметров", "Отказ,ПричинаОтказа");
	Страницы.Вставить("ПослеПолученияУзловОбмена", "Параметры,УзелОбменаЗагрузкаДанных");
	Страницы.Вставить("ПередЗагрузкойОбъекта", ИменаПередЗагрузкой);
	Страницы.Вставить("ПриПолученииУдаления", "Объект,Отказ");
	Страницы.Вставить("ПослеЗагрузкиОбъекта",
		"Отказ,Объект,Ссылка,ОбъектНайден,ПараметрыОбъекта,ОбъектМодифицирован,ИмяТипаОбъекта,НаборЗаписей");
	Страницы.Вставить("ПослеЗагрузкиДанных", "Параметры");
	
	Имена = Страницы.Получить(ИмяСтраницы);
	Если Имена = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Имена;
	
КонецФункции

#КонецОбласти
