// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
	Опции.ИмяСтраницы = "Запрос";
	Опции.ПоказыватьНаправление = Ложь;
	Если Объект.ИспользуетсяПриЗагрузке Тогда
		Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
	Иначе
		Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
	КонецЕсли;
	Элементы.ИспользуетсяПриЗагрузке.УстановитьДействие(
		"ПриИзменении", "Расш1_Подключаемый_ИспользуетсяПриЗагрузкеПриИзменении");
	Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.ТекстЗапроса, Опции);
	Расш1_КонсольКода.СоздатьХостКонсоли(ЭтотОбъект, ЭтотОбъект, "", Элементы.ТекстЗапроса);
	
	ИмяРеквизитаКонвертации = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаКонвертации();
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, ИмяРеквизитаКонвертации, "СправочникСсылка.Конвертации");
	ЭтотОбъект[ИмяРеквизитаКонвертации] = Расш1_КонсольКода.Расш1_КонвертацияЭлементаСостава(
		Объект.Ссылка, Параметры.Конвертация);
	Расш1_КонсольКода.ЗаполнитьРеквизитыПоиска(
		ЭтотОбъект,
		Параметры.Расш1_ФразаПоиска,
		Параметры.Расш1_ИмяПоляПоиска,
		Параметры.Расш1_НомерСтрокиПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, "Запрос");
	Расш1_КонсольКодаКлиент.ПерейтиКВхождению(ЭтотОбъект);
	ИмяРеквизитаКонвертации = Расш1_КонсольКодаКлиентСервер.ИмяРеквизитаКонвертации();
	Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект[ИмяРеквизитаКонвертации]);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	Если ИмяСобытия = Расш1_КонсольКодаКлиентСервер.ИмяСобытияПереходаКВхождению() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьПараметрыПоискаИзОповещения(ЭтотОбъект, Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик изменения флажка «Используется при загрузке».
//
// Параметры:
//  Элемент - ПолеФормы - флажок формы.
//
&НаКлиенте
Процедура Расш1_Подключаемый_ИспользуетсяПриЗагрузкеПриИзменении(Элемент)
	
	Если Объект.ИспользуетсяПриЗагрузке Тогда
		НаправлениеАлгоритма = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
	Иначе
		НаправлениеАлгоритма = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
	КонецЕсли;
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, НаправлениеАлгоритма);
	
КонецПроцедуры

// Обработчик события ДокументСформирован поля HTML консоли.
//
// Параметры:
//  Элемент - ПолеФормы - поле HTML консоли.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	Расш1_КонсольКодаКлиент.ВыделитьФразуПоиска(ЭтотОбъект);
	
КонецПроцедуры

// Обработчик события ПриНажатии поля HTML консоли.
//
// Параметры:
//  Элемент - ПолеФормы - поле HTML консоли.
//  ДанныеСобытия - ФиксированнаяСтруктура - данные события.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

// Обработчик команд консоли.
//
// Параметры:
//  Команда - КомандаФормы - выполняемая команда.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ИмяКоманды = Команда.Имя;
		КнопкаКоманды = Элементы[ИмяКоманды]; // КнопкаФормы
		ЗаголовокКоманды = КнопкаКоманды.Заголовок;
		Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, ЗаголовокКоманды);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

// Подменю командной панели к этому моменту уже закрыто.
//
// @skip-check module-unused-method
&НаКлиенте
Процедура Расш1_Подключаемый_ПоказатьЗакладки()
	
	Расш1_КонсольКодаКлиент.ПоказатьСписокЗакладокСейчас(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
