
#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКода;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.Алгоритм.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	HTMLДокумент = АдресКонсолиКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	КодКонсоли = КонсольКода.getText();
	// Запишем новый текст в реквизит.
	Объект.Алгоритм = КодКонсоли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_HTMLДокументДокументСформированПосле(Элемент)
	
	КонсольКода = Элементы.HTMLДокумент.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКода, Объект.Алгоритм);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_СветлаяТемаПосле(Команда)
	УстановитьТемуКонсоли("bsl-white");
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ТемнаяТемаПосле(Команда)
	УстановитьТемуКонсоли("bsl-dark");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьТемуКонсоли(Тема)
	Элементы.HTMLДокумент.Документ.monaco.editor.setTheme(Тема);
КонецПроцедуры

#КонецОбласти