
&НаСервере
&Вместо("ОбновитьПараметрыСписков_ГруппыПравил")
Процедура Расш1_ОбновитьПараметрыСписков_ГруппыПравил()
	
	НетОтбораПоГруппе = НЕ ЗначениеЗаполнено(ТекущаяГруппаПравил);
	ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("парГруппа", ТекущаяГруппаПравил);
	ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("парГруппа", ТекущаяГруппаПравил);
	ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
	ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
	// Начало изменений
	Алгоритмы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
	Алгоритмы.Параметры.УстановитьЗначениеПараметра("парГруппа", ТекущаяГруппаПравил);
	// Окончание изменений
	
	ПродолжитьВызов();
	
КонецПроцедуры

