
&НаКлиенте
Процедура Расш1_ПравилаОбработкиДанныхВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбора(СтандартнаяОбработка, "Справочник.ПравилаОбработкиДанных.Форма.ФормаЭлемента", ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_АлгоритмыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбора(СтандартнаяОбработка, "Справочник.Алгоритмы.Форма.ФормаЭлемента", ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПравилаКонвертацииОбъектовВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбора(СтандартнаяОбработка, "Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента", ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(СтандартнаяОбработка, ИмяФормы, ВыбраннаяСтрока)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Конвертация", Объект.Конвертация);
	ПараметрыОткрытия.Вставить("Ключ", ВыбраннаяСтрока);
	ОткрытьФорму(ИмяФормы, ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры
