
&НаСервере
&Вместо("ОбновитьПараметрыСписков_ГруппыПравил")
Процедура Расш1_ОбновитьПараметрыСписков_ГруппыПравил()
	
	НетОтбораПоГруппе = НЕ ЗначениеЗаполнено(ТекущаяГруппаПравил);
	ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("парГруппа", ТекущаяГруппаПравил);
	ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("парГруппа", ТекущаяГруппаПравил);
	ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
	ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
	
	// Начало изменений
	// 1. Нужно в запрос к алгоритмам добавить строчку:
	// ГДЕ (&НетОтбораПоГруппе = Истина) ИЛИ СправочникАлгоритмы.Группа В ИЕРАРХИИ (&парГруппа)
	ДобавляемаяСтрока = "ГДЕ (&НетОтбораПоГруппе = Истина) ИЛИ СправочникАлгоритмы.Группа В ИЕРАРХИИ (&парГруппа)";
	Если Не СтрНайти(Алгоритмы.ТекстЗапроса, ДобавляемаяСтрока) Тогда
		НовыйТекстЗапроса = Алгоритмы.ТекстЗапроса + Символы.ПС + ДобавляемаяСтрока;
		Алгоритмы.ТекстЗапроса = НовыйТекстЗапроса;
	КонецЕсли;
	
	Алгоритмы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
	Алгоритмы.Параметры.УстановитьЗначениеПараметра("парГруппа", ТекущаяГруппаПравил);
	// Окончание изменений
	
	//ПродолжитьВызов();
	
КонецПроцедуры

